Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
/*
 * Component description for FUSES
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-11-05T16:47:53Z  */
#ifndef _PIC32CMSG00_FUSES_COMPONENT_H_
#define _PIC32CMSG00_FUSES_COMPONENT_H_

/* ************************************************************************** */
/*                     SOFTWARE API DEFINITION FOR FUSES                      */
/* ************************************************************************** */

/* -------- FUSES_DAL : (FUSES Offset: 0x00) (R/W 32) DEVICE ACCESS LEVEL Register -------- */
#define FUSES_DAL_DAL_CPU_Pos                 _UINT32_(0)                                          /* (FUSES_DAL) CPU Device Access Level Position */
#define FUSES_DAL_DAL_CPU_Msk                 (_UINT32_(0xFFFFFFFF) << FUSES_DAL_DAL_CPU_Pos)      /* (FUSES_DAL) CPU Device Access Level Mask */
#define FUSES_DAL_DAL_CPU(value)              (FUSES_DAL_DAL_CPU_Msk & (_UINT32_(value) << FUSES_DAL_DAL_CPU_Pos)) /* Assignment of value for DAL_CPU in the FUSES_DAL register */
#define FUSES_DAL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (FUSES_DAL) Register Mask  */


/* -------- FUSES_FRCFGBROM : (FUSES Offset: 0x400) (R/W 32) PRE-BOOT bromc user Options Register -------- */
#define FUSES_FRCFGBROM_BCRCDIS_Pos           _UINT32_(0)                                          /* (FUSES_FRCFGBROM) Boot ROM CRC Disable Position */
#define FUSES_FRCFGBROM_BCRCDIS_Msk           (_UINT32_(0x1) << FUSES_FRCFGBROM_BCRCDIS_Pos)       /* (FUSES_FRCFGBROM) Boot ROM CRC Disable Mask */
#define FUSES_FRCFGBROM_BCRCDIS(value)        (FUSES_FRCFGBROM_BCRCDIS_Msk & (_UINT32_(value) << FUSES_FRCFGBROM_BCRCDIS_Pos)) /* Assignment of value for BCRCDIS in the FUSES_FRCFGBROM register */
#define FUSES_FRCFGBROM_Msk                   _UINT32_(0x00000001)                                 /* (FUSES_FRCFGBROM) Register Mask  */


/* -------- FUSES_FRCFGMBIST : (FUSES Offset: 0x408) (R/W 32) PRE-BOOT MBIST user Options Register -------- */
#define FUSES_FRCFGMBIST_MOBH_Pos             _UINT32_(2)                                          /* (FUSES_FRCFGMBIST) MBIST On Boot Enable for HIBERNATE Only Retaining Memory Groups Position */
#define FUSES_FRCFGMBIST_MOBH_Msk             (_UINT32_(0x3) << FUSES_FRCFGMBIST_MOBH_Pos)         /* (FUSES_FRCFGMBIST) MBIST On Boot Enable for HIBERNATE Only Retaining Memory Groups Mask */
#define FUSES_FRCFGMBIST_MOBH(value)          (FUSES_FRCFGMBIST_MOBH_Msk & (_UINT32_(value) << FUSES_FRCFGMBIST_MOBH_Pos)) /* Assignment of value for MOBH in the FUSES_FRCFGMBIST register */
#define   FUSES_FRCFGMBIST_MOBH_ENABLED_ANY_Val _UINT32_(0x1)                                        /* (FUSES_FRCFGMBIST) MOB runs after any non-BACKUP/HIBERNATE exit reset  */
#define   FUSES_FRCFGMBIST_MOBH_ENABLED_POR_Val _UINT32_(0x2)                                        /* (FUSES_FRCFGMBIST) MOB runs only after a POR  */
#define   FUSES_FRCFGMBIST_MOBH_DISABLED_Val  _UINT32_(0x3)                                        /* (FUSES_FRCFGMBIST) MOB Disabled  */
#define FUSES_FRCFGMBIST_MOBH_ENABLED_ANY     (FUSES_FRCFGMBIST_MOBH_ENABLED_ANY_Val << FUSES_FRCFGMBIST_MOBH_Pos) /* (FUSES_FRCFGMBIST) MOB runs after any non-BACKUP/HIBERNATE exit reset Position */
#define FUSES_FRCFGMBIST_MOBH_ENABLED_POR     (FUSES_FRCFGMBIST_MOBH_ENABLED_POR_Val << FUSES_FRCFGMBIST_MOBH_Pos) /* (FUSES_FRCFGMBIST) MOB runs only after a POR Position */
#define FUSES_FRCFGMBIST_MOBH_DISABLED        (FUSES_FRCFGMBIST_MOBH_DISABLED_Val << FUSES_FRCFGMBIST_MOBH_Pos) /* (FUSES_FRCFGMBIST) MOB Disabled Position */
#define FUSES_FRCFGMBIST_MOBB_Pos             _UINT32_(4)                                          /* (FUSES_FRCFGMBIST) MBIST On Boot Enable for BACKUP/HIBERNATE Retaining Memory Groups Position */
#define FUSES_FRCFGMBIST_MOBB_Msk             (_UINT32_(0x3) << FUSES_FRCFGMBIST_MOBB_Pos)         /* (FUSES_FRCFGMBIST) MBIST On Boot Enable for BACKUP/HIBERNATE Retaining Memory Groups Mask */
#define FUSES_FRCFGMBIST_MOBB(value)          (FUSES_FRCFGMBIST_MOBB_Msk & (_UINT32_(value) << FUSES_FRCFGMBIST_MOBB_Pos)) /* Assignment of value for MOBB in the FUSES_FRCFGMBIST register */
#define   FUSES_FRCFGMBIST_MOBB_ENABLED_ANY_Val _UINT32_(0x1)                                        /* (FUSES_FRCFGMBIST) MOB runs after any non-BACKUP/HIBERNATE exit reset  */
#define   FUSES_FRCFGMBIST_MOBB_ENABLED_POR_Val _UINT32_(0x2)                                        /* (FUSES_FRCFGMBIST) MOB runs only after a POR  */
#define   FUSES_FRCFGMBIST_MOBB_DISABLED_Val  _UINT32_(0x3)                                        /* (FUSES_FRCFGMBIST) MOB Disabled  */
#define FUSES_FRCFGMBIST_MOBB_ENABLED_ANY     (FUSES_FRCFGMBIST_MOBB_ENABLED_ANY_Val << FUSES_FRCFGMBIST_MOBB_Pos) /* (FUSES_FRCFGMBIST) MOB runs after any non-BACKUP/HIBERNATE exit reset Position */
#define FUSES_FRCFGMBIST_MOBB_ENABLED_POR     (FUSES_FRCFGMBIST_MOBB_ENABLED_POR_Val << FUSES_FRCFGMBIST_MOBB_Pos) /* (FUSES_FRCFGMBIST) MOB runs only after a POR Position */
#define FUSES_FRCFGMBIST_MOBB_DISABLED        (FUSES_FRCFGMBIST_MOBB_DISABLED_Val << FUSES_FRCFGMBIST_MOBB_Pos) /* (FUSES_FRCFGMBIST) MOB Disabled Position */
#define FUSES_FRCFGMBIST_Msk                  _UINT32_(0x0000003C)                                 /* (FUSES_FRCFGMBIST) Register Mask  */


/* -------- FUSES_KEYVAL_INTCHK0 : (FUSES Offset: 0x420) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_INTCHK0_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_INTCHK0) Mapped Fuse Register  Reset Value */

