Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
#define FUSES_KEYVAL_CE_ALL0_KEYVAL_CE_ALL0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL0)  Position */
#define FUSES_KEYVAL_CE_ALL0_KEYVAL_CE_ALL0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL0_KEYVAL_CE_ALL0_Pos) /* (FUSES_KEYVAL_CE_ALL0)  Mask */
#define FUSES_KEYVAL_CE_ALL0_KEYVAL_CE_ALL0(value) (FUSES_KEYVAL_CE_ALL0_KEYVAL_CE_ALL0_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL0_KEYVAL_CE_ALL0_Pos)) /* Assignment of value for KEYVAL_CE_ALL0 in the FUSES_KEYVAL_CE_ALL0 register */
#define FUSES_KEYVAL_CE_ALL0_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL0) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL1 : (FUSES Offset: 0x444) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_ALL1_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_ALL1_KEYVAL_CE_ALL1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL1)  Position */
#define FUSES_KEYVAL_CE_ALL1_KEYVAL_CE_ALL1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL1_KEYVAL_CE_ALL1_Pos) /* (FUSES_KEYVAL_CE_ALL1)  Mask */
#define FUSES_KEYVAL_CE_ALL1_KEYVAL_CE_ALL1(value) (FUSES_KEYVAL_CE_ALL1_KEYVAL_CE_ALL1_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL1_KEYVAL_CE_ALL1_Pos)) /* Assignment of value for KEYVAL_CE_ALL1 in the FUSES_KEYVAL_CE_ALL1 register */
#define FUSES_KEYVAL_CE_ALL1_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL1) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL2 : (FUSES Offset: 0x448) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_ALL2_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_ALL2_KEYVAL_CE_ALL2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL2)  Position */
#define FUSES_KEYVAL_CE_ALL2_KEYVAL_CE_ALL2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL2_KEYVAL_CE_ALL2_Pos) /* (FUSES_KEYVAL_CE_ALL2)  Mask */
#define FUSES_KEYVAL_CE_ALL2_KEYVAL_CE_ALL2(value) (FUSES_KEYVAL_CE_ALL2_KEYVAL_CE_ALL2_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL2_KEYVAL_CE_ALL2_Pos)) /* Assignment of value for KEYVAL_CE_ALL2 in the FUSES_KEYVAL_CE_ALL2 register */
#define FUSES_KEYVAL_CE_ALL2_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL2) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL3 : (FUSES Offset: 0x44C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_ALL3_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_ALL3_KEYVAL_CE_ALL3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL3)  Position */
#define FUSES_KEYVAL_CE_ALL3_KEYVAL_CE_ALL3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL3_KEYVAL_CE_ALL3_Pos) /* (FUSES_KEYVAL_CE_ALL3)  Mask */
#define FUSES_KEYVAL_CE_ALL3_KEYVAL_CE_ALL3(value) (FUSES_KEYVAL_CE_ALL3_KEYVAL_CE_ALL3_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL3_KEYVAL_CE_ALL3_Pos)) /* Assignment of value for KEYVAL_CE_ALL3 in the FUSES_KEYVAL_CE_ALL3 register */
#define FUSES_KEYVAL_CE_ALL3_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL3) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL4 : (FUSES Offset: 0x450) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_ALL4_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL4) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_ALL4_KEYVAL_CE_ALL4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL4)  Position */
#define FUSES_KEYVAL_CE_ALL4_KEYVAL_CE_ALL4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL4_KEYVAL_CE_ALL4_Pos) /* (FUSES_KEYVAL_CE_ALL4)  Mask */
#define FUSES_KEYVAL_CE_ALL4_KEYVAL_CE_ALL4(value) (FUSES_KEYVAL_CE_ALL4_KEYVAL_CE_ALL4_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL4_KEYVAL_CE_ALL4_Pos)) /* Assignment of value for KEYVAL_CE_ALL4 in the FUSES_KEYVAL_CE_ALL4 register */
#define FUSES_KEYVAL_CE_ALL4_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL4) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL5 : (FUSES Offset: 0x454) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_ALL5_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_ALL5_KEYVAL_CE_ALL5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL5)  Position */
#define FUSES_KEYVAL_CE_ALL5_KEYVAL_CE_ALL5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL5_KEYVAL_CE_ALL5_Pos) /* (FUSES_KEYVAL_CE_ALL5)  Mask */
#define FUSES_KEYVAL_CE_ALL5_KEYVAL_CE_ALL5(value) (FUSES_KEYVAL_CE_ALL5_KEYVAL_CE_ALL5_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL5_KEYVAL_CE_ALL5_Pos)) /* Assignment of value for KEYVAL_CE_ALL5 in the FUSES_KEYVAL_CE_ALL5 register */
#define FUSES_KEYVAL_CE_ALL5_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL5) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL6 : (FUSES Offset: 0x458) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_ALL6_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_ALL6_KEYVAL_CE_ALL6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL6)  Position */
#define FUSES_KEYVAL_CE_ALL6_KEYVAL_CE_ALL6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL6_KEYVAL_CE_ALL6_Pos) /* (FUSES_KEYVAL_CE_ALL6)  Mask */
#define FUSES_KEYVAL_CE_ALL6_KEYVAL_CE_ALL6(value) (FUSES_KEYVAL_CE_ALL6_KEYVAL_CE_ALL6_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL6_KEYVAL_CE_ALL6_Pos)) /* Assignment of value for KEYVAL_CE_ALL6 in the FUSES_KEYVAL_CE_ALL6 register */
#define FUSES_KEYVAL_CE_ALL6_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL6) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL7 : (FUSES Offset: 0x45C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_ALL7_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_ALL7_KEYVAL_CE_ALL7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL7)  Position */
#define FUSES_KEYVAL_CE_ALL7_KEYVAL_CE_ALL7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL7_KEYVAL_CE_ALL7_Pos) /* (FUSES_KEYVAL_CE_ALL7)  Mask */
#define FUSES_KEYVAL_CE_ALL7_KEYVAL_CE_ALL7(value) (FUSES_KEYVAL_CE_ALL7_KEYVAL_CE_ALL7_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL7_KEYVAL_CE_ALL7_Pos)) /* Assignment of value for KEYVAL_CE_ALL7 in the FUSES_KEYVAL_CE_ALL7 register */
#define FUSES_KEYVAL_CE_ALL7_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL7) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S_CR0 : (FUSES Offset: 0x460) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S_CR0_RESETVALUE      _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S_CR0) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S_CR0_KEYVAL_CE_S_CR0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S_CR0)  Position */
#define FUSES_KEYVAL_CE_S_CR0_KEYVAL_CE_S_CR0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S_CR0_KEYVAL_CE_S_CR0_Pos) /* (FUSES_KEYVAL_CE_S_CR0)  Mask */
#define FUSES_KEYVAL_CE_S_CR0_KEYVAL_CE_S_CR0(value) (FUSES_KEYVAL_CE_S_CR0_KEYVAL_CE_S_CR0_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S_CR0_KEYVAL_CE_S_CR0_Pos)) /* Assignment of value for KEYVAL_CE_S_CR0 in the FUSES_KEYVAL_CE_S_CR0 register */
#define FUSES_KEYVAL_CE_S_CR0_Msk             _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S_CR0) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S_CR1 : (FUSES Offset: 0x464) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S_CR1_RESETVALUE      _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S_CR1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S_CR1_KEYVAL_CE_S_CR1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S_CR1)  Position */
#define FUSES_KEYVAL_CE_S_CR1_KEYVAL_CE_S_CR1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S_CR1_KEYVAL_CE_S_CR1_Pos) /* (FUSES_KEYVAL_CE_S_CR1)  Mask */
#define FUSES_KEYVAL_CE_S_CR1_KEYVAL_CE_S_CR1(value) (FUSES_KEYVAL_CE_S_CR1_KEYVAL_CE_S_CR1_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S_CR1_KEYVAL_CE_S_CR1_Pos)) /* Assignment of value for KEYVAL_CE_S_CR1 in the FUSES_KEYVAL_CE_S_CR1 register */
#define FUSES_KEYVAL_CE_S_CR1_Msk             _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S_CR1) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S_CR2 : (FUSES Offset: 0x468) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S_CR2_RESETVALUE      _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S_CR2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S_CR2_KEYVAL_CE_S_CR2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S_CR2)  Position */
#define FUSES_KEYVAL_CE_S_CR2_KEYVAL_CE_S_CR2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S_CR2_KEYVAL_CE_S_CR2_Pos) /* (FUSES_KEYVAL_CE_S_CR2)  Mask */
#define FUSES_KEYVAL_CE_S_CR2_KEYVAL_CE_S_CR2(value) (FUSES_KEYVAL_CE_S_CR2_KEYVAL_CE_S_CR2_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S_CR2_KEYVAL_CE_S_CR2_Pos)) /* Assignment of value for KEYVAL_CE_S_CR2 in the FUSES_KEYVAL_CE_S_CR2 register */
#define FUSES_KEYVAL_CE_S_CR2_Msk             _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S_CR2) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S_CR3 : (FUSES Offset: 0x46C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S_CR3_RESETVALUE      _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S_CR3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S_CR3_KEYVAL_CE_S_CR3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S_CR3)  Position */
#define FUSES_KEYVAL_CE_S_CR3_KEYVAL_CE_S_CR3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S_CR3_KEYVAL_CE_S_CR3_Pos) /* (FUSES_KEYVAL_CE_S_CR3)  Mask */
#define FUSES_KEYVAL_CE_S_CR3_KEYVAL_CE_S_CR3(value) (FUSES_KEYVAL_CE_S_CR3_KEYVAL_CE_S_CR3_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S_CR3_KEYVAL_CE_S_CR3_Pos)) /* Assignment of value for KEYVAL_CE_S_CR3 in the FUSES_KEYVAL_CE_S_CR3 register */
#define FUSES_KEYVAL_CE_S_CR3_Msk             _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S_CR3) Register Mask  */


