Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
/* -------- FUSES_KEYVAL_CE_S_CR4 : (FUSES Offset: 0x470) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S_CR4_RESETVALUE      _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S_CR4) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S_CR4_KEYVAL_CE_S_CR4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S_CR4)  Position */
#define FUSES_KEYVAL_CE_S_CR4_KEYVAL_CE_S_CR4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S_CR4_KEYVAL_CE_S_CR4_Pos) /* (FUSES_KEYVAL_CE_S_CR4)  Mask */
#define FUSES_KEYVAL_CE_S_CR4_KEYVAL_CE_S_CR4(value) (FUSES_KEYVAL_CE_S_CR4_KEYVAL_CE_S_CR4_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S_CR4_KEYVAL_CE_S_CR4_Pos)) /* Assignment of value for KEYVAL_CE_S_CR4 in the FUSES_KEYVAL_CE_S_CR4 register */
#define FUSES_KEYVAL_CE_S_CR4_Msk             _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S_CR4) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S_CR5 : (FUSES Offset: 0x474) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S_CR5_RESETVALUE      _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S_CR5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S_CR5_KEYVAL_CE_S_CR5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S_CR5)  Position */
#define FUSES_KEYVAL_CE_S_CR5_KEYVAL_CE_S_CR5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S_CR5_KEYVAL_CE_S_CR5_Pos) /* (FUSES_KEYVAL_CE_S_CR5)  Mask */
#define FUSES_KEYVAL_CE_S_CR5_KEYVAL_CE_S_CR5(value) (FUSES_KEYVAL_CE_S_CR5_KEYVAL_CE_S_CR5_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S_CR5_KEYVAL_CE_S_CR5_Pos)) /* Assignment of value for KEYVAL_CE_S_CR5 in the FUSES_KEYVAL_CE_S_CR5 register */
#define FUSES_KEYVAL_CE_S_CR5_Msk             _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S_CR5) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S_CR6 : (FUSES Offset: 0x478) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S_CR6_RESETVALUE      _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S_CR6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S_CR6_KEYVAL_CE_S_CR6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S_CR6)  Position */
#define FUSES_KEYVAL_CE_S_CR6_KEYVAL_CE_S_CR6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S_CR6_KEYVAL_CE_S_CR6_Pos) /* (FUSES_KEYVAL_CE_S_CR6)  Mask */
#define FUSES_KEYVAL_CE_S_CR6_KEYVAL_CE_S_CR6(value) (FUSES_KEYVAL_CE_S_CR6_KEYVAL_CE_S_CR6_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S_CR6_KEYVAL_CE_S_CR6_Pos)) /* Assignment of value for KEYVAL_CE_S_CR6 in the FUSES_KEYVAL_CE_S_CR6 register */
#define FUSES_KEYVAL_CE_S_CR6_Msk             _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S_CR6) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S_CR7 : (FUSES Offset: 0x47C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S_CR7_RESETVALUE      _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S_CR7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S_CR7_KEYVAL_CE_S_CR7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S_CR7)  Position */
#define FUSES_KEYVAL_CE_S_CR7_KEYVAL_CE_S_CR7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S_CR7_KEYVAL_CE_S_CR7_Pos) /* (FUSES_KEYVAL_CE_S_CR7)  Mask */
#define FUSES_KEYVAL_CE_S_CR7_KEYVAL_CE_S_CR7(value) (FUSES_KEYVAL_CE_S_CR7_KEYVAL_CE_S_CR7_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S_CR7_KEYVAL_CE_S_CR7_Pos)) /* Assignment of value for KEYVAL_CE_S_CR7 in the FUSES_KEYVAL_CE_S_CR7 register */
#define FUSES_KEYVAL_CE_S_CR7_Msk             _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S_CR7) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S0 : (FUSES Offset: 0x480) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S0_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S0) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S0_KEYVAL_CE_S0_Pos   _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S0)  Position */
#define FUSES_KEYVAL_CE_S0_KEYVAL_CE_S0_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S0_KEYVAL_CE_S0_Pos) /* (FUSES_KEYVAL_CE_S0)  Mask */
#define FUSES_KEYVAL_CE_S0_KEYVAL_CE_S0(value) (FUSES_KEYVAL_CE_S0_KEYVAL_CE_S0_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S0_KEYVAL_CE_S0_Pos)) /* Assignment of value for KEYVAL_CE_S0 in the FUSES_KEYVAL_CE_S0 register */
#define FUSES_KEYVAL_CE_S0_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S0) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S1 : (FUSES Offset: 0x484) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S1_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S1_KEYVAL_CE_S1_Pos   _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S1)  Position */
#define FUSES_KEYVAL_CE_S1_KEYVAL_CE_S1_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S1_KEYVAL_CE_S1_Pos) /* (FUSES_KEYVAL_CE_S1)  Mask */
#define FUSES_KEYVAL_CE_S1_KEYVAL_CE_S1(value) (FUSES_KEYVAL_CE_S1_KEYVAL_CE_S1_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S1_KEYVAL_CE_S1_Pos)) /* Assignment of value for KEYVAL_CE_S1 in the FUSES_KEYVAL_CE_S1 register */
#define FUSES_KEYVAL_CE_S1_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S1) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S2 : (FUSES Offset: 0x488) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S2_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S2_KEYVAL_CE_S2_Pos   _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S2)  Position */
#define FUSES_KEYVAL_CE_S2_KEYVAL_CE_S2_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S2_KEYVAL_CE_S2_Pos) /* (FUSES_KEYVAL_CE_S2)  Mask */
#define FUSES_KEYVAL_CE_S2_KEYVAL_CE_S2(value) (FUSES_KEYVAL_CE_S2_KEYVAL_CE_S2_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S2_KEYVAL_CE_S2_Pos)) /* Assignment of value for KEYVAL_CE_S2 in the FUSES_KEYVAL_CE_S2 register */
#define FUSES_KEYVAL_CE_S2_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S2) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S3 : (FUSES Offset: 0x48C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S3_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S3_KEYVAL_CE_S3_Pos   _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S3)  Position */
#define FUSES_KEYVAL_CE_S3_KEYVAL_CE_S3_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S3_KEYVAL_CE_S3_Pos) /* (FUSES_KEYVAL_CE_S3)  Mask */
#define FUSES_KEYVAL_CE_S3_KEYVAL_CE_S3(value) (FUSES_KEYVAL_CE_S3_KEYVAL_CE_S3_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S3_KEYVAL_CE_S3_Pos)) /* Assignment of value for KEYVAL_CE_S3 in the FUSES_KEYVAL_CE_S3 register */
#define FUSES_KEYVAL_CE_S3_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S3) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S4 : (FUSES Offset: 0x490) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S4_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S4) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S4_KEYVAL_CE_S4_Pos   _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S4)  Position */
#define FUSES_KEYVAL_CE_S4_KEYVAL_CE_S4_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S4_KEYVAL_CE_S4_Pos) /* (FUSES_KEYVAL_CE_S4)  Mask */
#define FUSES_KEYVAL_CE_S4_KEYVAL_CE_S4(value) (FUSES_KEYVAL_CE_S4_KEYVAL_CE_S4_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S4_KEYVAL_CE_S4_Pos)) /* Assignment of value for KEYVAL_CE_S4 in the FUSES_KEYVAL_CE_S4 register */
#define FUSES_KEYVAL_CE_S4_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S4) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S5 : (FUSES Offset: 0x494) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S5_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S5) Mapped Fuse Register  Reset Value */

