Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos     _UINT32_(0)                                          /* (FUSES_BOOT_GPIOSEL) Selects IO Port Pin for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL_Msk     (_UINT32_(0x1F) << FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Selects IO Port Pin for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL(value)  (FUSES_BOOT_GPIOSEL_GPIOPINSEL_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos)) /* Assignment of value for GPIOPINSEL in the FUSES_BOOT_GPIOSEL register */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos    _UINT32_(5)                                          /* (FUSES_BOOT_GPIOSEL) Selects IO Port for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Msk    (_UINT32_(0xF) << FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Selects IO Port for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL(value) (FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos)) /* Assignment of value for GPIOPORTSEL in the FUSES_BOOT_GPIOSEL register */
#define FUSES_BOOT_GPIOSEL_FLTPOL_Pos         _UINT32_(9)                                          /* (FUSES_BOOT_GPIOSEL) Selects IO Port for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_FLTPOL_Msk         (_UINT32_(0x1) << FUSES_BOOT_GPIOSEL_FLTPOL_Pos)     /* (FUSES_BOOT_GPIOSEL) Selects IO Port for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_FLTPOL(value)      (FUSES_BOOT_GPIOSEL_FLTPOL_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_FLTPOL_Pos)) /* Assignment of value for FLTPOL in the FUSES_BOOT_GPIOSEL register */
#define FUSES_BOOT_GPIOSEL_FLTODRAIN_Pos      _UINT32_(11)                                         /* (FUSES_BOOT_GPIOSEL) Open Drain Control for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_FLTODRAIN_Msk      (_UINT32_(0x1) << FUSES_BOOT_GPIOSEL_FLTODRAIN_Pos)  /* (FUSES_BOOT_GPIOSEL) Open Drain Control for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_FLTODRAIN(value)   (FUSES_BOOT_GPIOSEL_FLTODRAIN_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_FLTODRAIN_Pos)) /* Assignment of value for FLTODRAIN in the FUSES_BOOT_GPIOSEL register */
#define FUSES_BOOT_GPIOSEL_FLTSLEWLIM_Pos     _UINT32_(12)                                         /* (FUSES_BOOT_GPIOSEL) Selects Driver Slew Rate Selection for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_FLTSLEWLIM_Msk     (_UINT32_(0x3) << FUSES_BOOT_GPIOSEL_FLTSLEWLIM_Pos) /* (FUSES_BOOT_GPIOSEL) Selects Driver Slew Rate Selection for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_FLTSLEWLIM(value)  (FUSES_BOOT_GPIOSEL_FLTSLEWLIM_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_FLTSLEWLIM_Pos)) /* Assignment of value for FLTSLEWLIM in the FUSES_BOOT_GPIOSEL register */
#define FUSES_BOOT_GPIOSEL_Msk                _UINT32_(0x00003BFF)                                 /* (FUSES_BOOT_GPIOSEL) Register Mask  */


/* -------- FUSES_H2PB0_NONSECCLRA : (FUSES Offset: 0x81C) (R/W 32) Non-Security Clear Register A -------- */
#define FUSES_H2PB0_NONSECCLRA_RESETVALUE     _UINT32_(0xFFFFFFFE)                                 /*  (FUSES_H2PB0_NONSECCLRA) Non-Security Clear Register A  Reset Value */

#define FUSES_H2PB0_NONSECCLRA_NONSEC0_Pos    _UINT32_(0)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC0_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC0_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC0(value) (FUSES_H2PB0_NONSECCLRA_NONSEC0_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC0_Pos)) /* Assignment of value for NONSEC0 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC1_Pos    _UINT32_(1)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC1_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC1_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC1(value) (FUSES_H2PB0_NONSECCLRA_NONSEC1_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC1_Pos)) /* Assignment of value for NONSEC1 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC2_Pos    _UINT32_(2)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC2_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC2_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC2(value) (FUSES_H2PB0_NONSECCLRA_NONSEC2_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC2_Pos)) /* Assignment of value for NONSEC2 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC3_Pos    _UINT32_(3)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC3_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC3_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC3(value) (FUSES_H2PB0_NONSECCLRA_NONSEC3_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC3_Pos)) /* Assignment of value for NONSEC3 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC4_Pos    _UINT32_(4)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC4_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC4_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC4(value) (FUSES_H2PB0_NONSECCLRA_NONSEC4_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC4_Pos)) /* Assignment of value for NONSEC4 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC5_Pos    _UINT32_(5)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC5_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC5_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC5(value) (FUSES_H2PB0_NONSECCLRA_NONSEC5_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC5_Pos)) /* Assignment of value for NONSEC5 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC6_Pos    _UINT32_(6)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC6_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC6_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC6(value) (FUSES_H2PB0_NONSECCLRA_NONSEC6_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC6_Pos)) /* Assignment of value for NONSEC6 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC7_Pos    _UINT32_(7)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC7_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC7_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC7(value) (FUSES_H2PB0_NONSECCLRA_NONSEC7_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC7_Pos)) /* Assignment of value for NONSEC7 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC8_Pos    _UINT32_(8)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC8_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC8_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC8(value) (FUSES_H2PB0_NONSECCLRA_NONSEC8_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC8_Pos)) /* Assignment of value for NONSEC8 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC9_Pos    _UINT32_(9)                                          /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC9_Msk    (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC9_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC9(value) (FUSES_H2PB0_NONSECCLRA_NONSEC9_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC9_Pos)) /* Assignment of value for NONSEC9 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC10_Pos   _UINT32_(10)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC10_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC10_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC10(value) (FUSES_H2PB0_NONSECCLRA_NONSEC10_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC10_Pos)) /* Assignment of value for NONSEC10 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC11_Pos   _UINT32_(11)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC11_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC11_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC11(value) (FUSES_H2PB0_NONSECCLRA_NONSEC11_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC11_Pos)) /* Assignment of value for NONSEC11 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC12_Pos   _UINT32_(12)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC12_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC12_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC12(value) (FUSES_H2PB0_NONSECCLRA_NONSEC12_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC12_Pos)) /* Assignment of value for NONSEC12 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC13_Pos   _UINT32_(13)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC13_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC13_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC13(value) (FUSES_H2PB0_NONSECCLRA_NONSEC13_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC13_Pos)) /* Assignment of value for NONSEC13 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC14_Pos   _UINT32_(14)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC14_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC14_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC14(value) (FUSES_H2PB0_NONSECCLRA_NONSEC14_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC14_Pos)) /* Assignment of value for NONSEC14 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC15_Pos   _UINT32_(15)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC15_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC15_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC15(value) (FUSES_H2PB0_NONSECCLRA_NONSEC15_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC15_Pos)) /* Assignment of value for NONSEC15 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC16_Pos   _UINT32_(16)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC16_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC16_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC16(value) (FUSES_H2PB0_NONSECCLRA_NONSEC16_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC16_Pos)) /* Assignment of value for NONSEC16 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC17_Pos   _UINT32_(17)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC17_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC17_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC17(value) (FUSES_H2PB0_NONSECCLRA_NONSEC17_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC17_Pos)) /* Assignment of value for NONSEC17 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC18_Pos   _UINT32_(18)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC18_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC18_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC18(value) (FUSES_H2PB0_NONSECCLRA_NONSEC18_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC18_Pos)) /* Assignment of value for NONSEC18 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC19_Pos   _UINT32_(19)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC19_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC19_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC19(value) (FUSES_H2PB0_NONSECCLRA_NONSEC19_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC19_Pos)) /* Assignment of value for NONSEC19 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC20_Pos   _UINT32_(20)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC20_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC20_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC20(value) (FUSES_H2PB0_NONSECCLRA_NONSEC20_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC20_Pos)) /* Assignment of value for NONSEC20 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC21_Pos   _UINT32_(21)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC21_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC21_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC21(value) (FUSES_H2PB0_NONSECCLRA_NONSEC21_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC21_Pos)) /* Assignment of value for NONSEC21 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC22_Pos   _UINT32_(22)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC22_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC22_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC22(value) (FUSES_H2PB0_NONSECCLRA_NONSEC22_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC22_Pos)) /* Assignment of value for NONSEC22 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC23_Pos   _UINT32_(23)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC23_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC23_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC23(value) (FUSES_H2PB0_NONSECCLRA_NONSEC23_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC23_Pos)) /* Assignment of value for NONSEC23 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC24_Pos   _UINT32_(24)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC24_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC24_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC24(value) (FUSES_H2PB0_NONSECCLRA_NONSEC24_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC24_Pos)) /* Assignment of value for NONSEC24 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC25_Pos   _UINT32_(25)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC25_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC25_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC25(value) (FUSES_H2PB0_NONSECCLRA_NONSEC25_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC25_Pos)) /* Assignment of value for NONSEC25 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC26_Pos   _UINT32_(26)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC26_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC26_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC26(value) (FUSES_H2PB0_NONSECCLRA_NONSEC26_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC26_Pos)) /* Assignment of value for NONSEC26 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC27_Pos   _UINT32_(27)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC27_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC27_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC27(value) (FUSES_H2PB0_NONSECCLRA_NONSEC27_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC27_Pos)) /* Assignment of value for NONSEC27 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC28_Pos   _UINT32_(28)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC28_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC28_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC28(value) (FUSES_H2PB0_NONSECCLRA_NONSEC28_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC28_Pos)) /* Assignment of value for NONSEC28 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC29_Pos   _UINT32_(29)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC29_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC29_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC29(value) (FUSES_H2PB0_NONSECCLRA_NONSEC29_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC29_Pos)) /* Assignment of value for NONSEC29 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC30_Pos   _UINT32_(30)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC30_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC30_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC30(value) (FUSES_H2PB0_NONSECCLRA_NONSEC30_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC30_Pos)) /* Assignment of value for NONSEC30 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_NONSEC31_Pos   _UINT32_(31)                                         /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Position */
#define FUSES_H2PB0_NONSECCLRA_NONSEC31_Msk   (_UINT32_(0x1) << FUSES_H2PB0_NONSECCLRA_NONSEC31_Pos) /* (FUSES_H2PB0_NONSECCLRA) non-security bit for APB Slave k, k=0..31 Mask */
#define FUSES_H2PB0_NONSECCLRA_NONSEC31(value) (FUSES_H2PB0_NONSECCLRA_NONSEC31_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC31_Pos)) /* Assignment of value for NONSEC31 in the FUSES_H2PB0_NONSECCLRA register */
#define FUSES_H2PB0_NONSECCLRA_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_H2PB0_NONSECCLRA) Register Mask  */

#define FUSES_H2PB0_NONSECCLRA_NONSEC_Pos     _UINT32_(0)                                          /* (FUSES_H2PB0_NONSECCLRA Position) non-security bit for APB Slave k, k=x..3x */
#define FUSES_H2PB0_NONSECCLRA_NONSEC_Msk     (_UINT32_(0xFFFFFFFF) << FUSES_H2PB0_NONSECCLRA_NONSEC_Pos) /* (FUSES_H2PB0_NONSECCLRA Mask) NONSEC */
#define FUSES_H2PB0_NONSECCLRA_NONSEC(value)  (FUSES_H2PB0_NONSECCLRA_NONSEC_Msk & (_UINT32_(value) << FUSES_H2PB0_NONSECCLRA_NONSEC_Pos)) 

/* -------- FUSES_H2PB0_NONSECSETA : (FUSES Offset: 0x820) (R/W 32) Non-Security SET Register A -------- */
#define FUSES_H2PB0_NONSECSETA_RESETVALUE     _UINT32_(0x01)                                       /*  (FUSES_H2PB0_NONSECSETA) Non-Security SET Register A  Reset Value */

