Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
/* -------- FUSES_PAC_WRCTRL_H2PB2 : (FUSES Offset: 0x860) (R/W 32) Write Control Register -------- */
#define FUSES_PAC_WRCTRL_H2PB2_RESETVALUE     _UINT32_(0x2F)                                       /*  (FUSES_PAC_WRCTRL_H2PB2) Write Control Register  Reset Value */

#define FUSES_PAC_WRCTRL_H2PB2_PERID_Pos      _UINT32_(0)                                          /* (FUSES_PAC_WRCTRL_H2PB2) Peripheral Identifier Position */
#define FUSES_PAC_WRCTRL_H2PB2_PERID_Msk      (_UINT32_(0xFF) << FUSES_PAC_WRCTRL_H2PB2_PERID_Pos) /* (FUSES_PAC_WRCTRL_H2PB2) Peripheral Identifier Mask */
#define FUSES_PAC_WRCTRL_H2PB2_PERID(value)   (FUSES_PAC_WRCTRL_H2PB2_PERID_Msk & (_UINT32_(value) << FUSES_PAC_WRCTRL_H2PB2_PERID_Pos)) /* Assignment of value for PERID in the FUSES_PAC_WRCTRL_H2PB2 register */
#define FUSES_PAC_WRCTRL_H2PB2_KEY_Pos        _UINT32_(16)                                         /* (FUSES_PAC_WRCTRL_H2PB2) Peripheral Access Control Key Position */
#define FUSES_PAC_WRCTRL_H2PB2_KEY_Msk        (_UINT32_(0xFF) << FUSES_PAC_WRCTRL_H2PB2_KEY_Pos)   /* (FUSES_PAC_WRCTRL_H2PB2) Peripheral Access Control Key Mask */
#define FUSES_PAC_WRCTRL_H2PB2_KEY(value)     (FUSES_PAC_WRCTRL_H2PB2_KEY_Msk & (_UINT32_(value) << FUSES_PAC_WRCTRL_H2PB2_KEY_Pos)) /* Assignment of value for KEY in the FUSES_PAC_WRCTRL_H2PB2 register */
#define   FUSES_PAC_WRCTRL_H2PB2_KEY_OFF_Val  _UINT32_(0x0)                                        /* (FUSES_PAC_WRCTRL_H2PB2) OFF - No Action  */
#define   FUSES_PAC_WRCTRL_H2PB2_KEY_CLEAR_Val _UINT32_(0x1)                                        /* (FUSES_PAC_WRCTRL_H2PB2) CLEAR - Clear the peripheral write protection  */
#define   FUSES_PAC_WRCTRL_H2PB2_KEY_SET_Val  _UINT32_(0x2)                                        /* (FUSES_PAC_WRCTRL_H2PB2) SET - Set the peripheral write protection  */
#define   FUSES_PAC_WRCTRL_H2PB2_KEY_LOCK_Val _UINT32_(0x3)                                        /* (FUSES_PAC_WRCTRL_H2PB2) LOCK - Set and Lock the write protection state of the peripheral until the next reset  */
#define FUSES_PAC_WRCTRL_H2PB2_KEY_OFF        (FUSES_PAC_WRCTRL_H2PB2_KEY_OFF_Val << FUSES_PAC_WRCTRL_H2PB2_KEY_Pos) /* (FUSES_PAC_WRCTRL_H2PB2) OFF - No Action Position */
#define FUSES_PAC_WRCTRL_H2PB2_KEY_CLEAR      (FUSES_PAC_WRCTRL_H2PB2_KEY_CLEAR_Val << FUSES_PAC_WRCTRL_H2PB2_KEY_Pos) /* (FUSES_PAC_WRCTRL_H2PB2) CLEAR - Clear the peripheral write protection Position */
#define FUSES_PAC_WRCTRL_H2PB2_KEY_SET        (FUSES_PAC_WRCTRL_H2PB2_KEY_SET_Val << FUSES_PAC_WRCTRL_H2PB2_KEY_Pos) /* (FUSES_PAC_WRCTRL_H2PB2) SET - Set the peripheral write protection Position */
#define FUSES_PAC_WRCTRL_H2PB2_KEY_LOCK       (FUSES_PAC_WRCTRL_H2PB2_KEY_LOCK_Val << FUSES_PAC_WRCTRL_H2PB2_KEY_Pos) /* (FUSES_PAC_WRCTRL_H2PB2) LOCK - Set and Lock the write protection state of the peripheral until the next reset Position */
#define FUSES_PAC_WRCTRL_H2PB2_Msk            _UINT32_(0x00FF00FF)                                 /* (FUSES_PAC_WRCTRL_H2PB2) Register Mask  */


/* -------- FUSES_IDAU_RCTRL_BFM : (FUSES Offset: 0x864) (R/W 32) Region Control -------- */
#define FUSES_IDAU_RCTRL_BFM_RESETVALUE       _UINT32_(0x5C000000)                                 /*  (FUSES_IDAU_RCTRL_BFM) Region Control  Reset Value */

#define FUSES_IDAU_RCTRL_BFM_Msk              _UINT32_(0x00000000)                                 /* (FUSES_IDAU_RCTRL_BFM) Register Mask  */

/* BLOCK mode */
#define FUSES_IDAU_RCTRL_BFM_BLOCK_ARG_Pos    _UINT32_(0)                                          /* (FUSES_IDAU_RCTRL_BFM) IDAU Region Control BFM Command Argument (Block ID) Position */
#define FUSES_IDAU_RCTRL_BFM_BLOCK_ARG_Msk    (_UINT32_(0x1F) << FUSES_IDAU_RCTRL_BFM_BLOCK_ARG_Pos) /* (FUSES_IDAU_RCTRL_BFM) IDAU Region Control BFM Command Argument (Block ID) Mask */
#define FUSES_IDAU_RCTRL_BFM_BLOCK_ARG(value) (FUSES_IDAU_RCTRL_BFM_BLOCK_ARG_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_BFM_BLOCK_ARG_Pos))
#define FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_Pos    _UINT32_(24)                                         /* (FUSES_IDAU_RCTRL_BFM) IDAU Region Control BFM Command Position */
#define FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_Msk    (_UINT32_(0xFF) << FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_BFM) IDAU Region Control BFM Command Mask */
#define FUSES_IDAU_RCTRL_BFM_BLOCK_CMD(value) (FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_Pos))
#define   FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_CLRNONSEC_Val _UINT32_(0x5A)                                       /* (FUSES_IDAU_RCTRL_BFM) Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)  */
#define   FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_SETNONSEC_Val _UINT32_(0x5B)                                       /* (FUSES_IDAU_RCTRL_BFM) Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)  */
#define FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_CLRNONSEC (FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_CLRNONSEC_Val << FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_BFM) Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0) Position */
#define FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_SETNONSEC (FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_SETNONSEC_Val << FUSES_IDAU_RCTRL_BFM_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_BFM) Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1) Position */
#define FUSES_IDAU_RCTRL_BFM_BLOCK_Msk        _UINT32_(0xFF00001F)                                 /* (FUSES_IDAU_RCTRL_BFM_BLOCK) Register Mask  */

/* WATERMARK mode */
#define FUSES_IDAU_RCTRL_BFM_WATERMARK_ARG_Pos _UINT32_(0)                                          /* (FUSES_IDAU_RCTRL_BFM) IDAU Region Control BFM Command Argument (Watermark) Position */
#define FUSES_IDAU_RCTRL_BFM_WATERMARK_ARG_Msk (_UINT32_(0xFFFFFF) << FUSES_IDAU_RCTRL_BFM_WATERMARK_ARG_Pos) /* (FUSES_IDAU_RCTRL_BFM) IDAU Region Control BFM Command Argument (Watermark) Mask */
#define FUSES_IDAU_RCTRL_BFM_WATERMARK_ARG(value) (FUSES_IDAU_RCTRL_BFM_WATERMARK_ARG_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_BFM_WATERMARK_ARG_Pos))
#define FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_Pos _UINT32_(24)                                         /* (FUSES_IDAU_RCTRL_BFM) IDAU Region Control BFM Command Position */
#define FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_Msk (_UINT32_(0xFF) << FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_Pos) /* (FUSES_IDAU_RCTRL_BFM) IDAU Region Control BFM Command Mask */
#define FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD(value) (FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_Pos))
#define   FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_WRSZ_Val _UINT32_(0x5C)                                       /* (FUSES_IDAU_RCTRL_BFM) Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)  */
#define FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_WRSZ (FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_WRSZ_Val << FUSES_IDAU_RCTRL_BFM_WATERMARK_CMD_Pos) /* (FUSES_IDAU_RCTRL_BFM) Write IDAU region x Size (RSTATUSB[x].SIZE=ARG) Position */
#define FUSES_IDAU_RCTRL_BFM_WATERMARK_Msk    _UINT32_(0xFFFFFFFF)                                 /* (FUSES_IDAU_RCTRL_BFM_WATERMARK) Register Mask  */


/* -------- FUSES_IDAU_RCTRL_PFMANS : (FUSES Offset: 0x868) (R/W 32) Region Control -------- */
#define FUSES_IDAU_RCTRL_PFMANS_RESETVALUE    _UINT32_(0x5C000000)                                 /*  (FUSES_IDAU_RCTRL_PFMANS) Region Control  Reset Value */

