Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
#define FUSES_IDAU_RCTRL_DRM_Msk              _UINT32_(0x00000000)                                 /* (FUSES_IDAU_RCTRL_DRM) Register Mask  */

/* BLOCK mode */
#define FUSES_IDAU_RCTRL_DRM_BLOCK_ARG_Pos    _UINT32_(0)                                          /* (FUSES_IDAU_RCTRL_DRM) IDAU Region Control DRM Command Argument (Block ID) Position */
#define FUSES_IDAU_RCTRL_DRM_BLOCK_ARG_Msk    (_UINT32_(0x1F) << FUSES_IDAU_RCTRL_DRM_BLOCK_ARG_Pos) /* (FUSES_IDAU_RCTRL_DRM) IDAU Region Control DRM Command Argument (Block ID) Mask */
#define FUSES_IDAU_RCTRL_DRM_BLOCK_ARG(value) (FUSES_IDAU_RCTRL_DRM_BLOCK_ARG_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_DRM_BLOCK_ARG_Pos))
#define FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_Pos    _UINT32_(24)                                         /* (FUSES_IDAU_RCTRL_DRM) IDAU Region Control DRM Command Position */
#define FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_Msk    (_UINT32_(0xFF) << FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_DRM) IDAU Region Control DRM Command Mask */
#define FUSES_IDAU_RCTRL_DRM_BLOCK_CMD(value) (FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_Pos))
#define   FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_CLRNONSEC_Val _UINT32_(0x5A)                                       /* (FUSES_IDAU_RCTRL_DRM) Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)  */
#define   FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_SETNONSEC_Val _UINT32_(0x5B)                                       /* (FUSES_IDAU_RCTRL_DRM) Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)  */
#define FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_CLRNONSEC (FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_CLRNONSEC_Val << FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_DRM) Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0) Position */
#define FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_SETNONSEC (FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_SETNONSEC_Val << FUSES_IDAU_RCTRL_DRM_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_DRM) Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1) Position */
#define FUSES_IDAU_RCTRL_DRM_BLOCK_Msk        _UINT32_(0xFF00001F)                                 /* (FUSES_IDAU_RCTRL_DRM_BLOCK) Register Mask  */

/* WATERMARK mode */
#define FUSES_IDAU_RCTRL_DRM_WATERMARK_ARG_Pos _UINT32_(0)                                          /* (FUSES_IDAU_RCTRL_DRM) IDAU Region Control DRM Command Argument (Watermark) Position */
#define FUSES_IDAU_RCTRL_DRM_WATERMARK_ARG_Msk (_UINT32_(0xFFFFFF) << FUSES_IDAU_RCTRL_DRM_WATERMARK_ARG_Pos) /* (FUSES_IDAU_RCTRL_DRM) IDAU Region Control DRM Command Argument (Watermark) Mask */
#define FUSES_IDAU_RCTRL_DRM_WATERMARK_ARG(value) (FUSES_IDAU_RCTRL_DRM_WATERMARK_ARG_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_DRM_WATERMARK_ARG_Pos))
#define FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_Pos _UINT32_(24)                                         /* (FUSES_IDAU_RCTRL_DRM) IDAU Region Control DRM Command Position */
#define FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_Msk (_UINT32_(0xFF) << FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_Pos) /* (FUSES_IDAU_RCTRL_DRM) IDAU Region Control DRM Command Mask */
#define FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD(value) (FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_Pos))
#define   FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_WRSZ_Val _UINT32_(0x5C)                                       /* (FUSES_IDAU_RCTRL_DRM) Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)  */
#define FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_WRSZ (FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_WRSZ_Val << FUSES_IDAU_RCTRL_DRM_WATERMARK_CMD_Pos) /* (FUSES_IDAU_RCTRL_DRM) Write IDAU region x Size (RSTATUSB[x].SIZE=ARG) Position */
#define FUSES_IDAU_RCTRL_DRM_WATERMARK_Msk    _UINT32_(0xFFFFFFFF)                                 /* (FUSES_IDAU_RCTRL_DRM_WATERMARK) Register Mask  */


/* -------- FUSES_IDAU_CTRL_EN : (FUSES Offset: 0x874) (R/W 32) Control -------- */
#define FUSES_IDAU_CTRL_EN_RESETVALUE         _UINT32_(0xA5010000)                                 /*  (FUSES_IDAU_CTRL_EN) Control  Reset Value */

#define FUSES_IDAU_CTRL_EN_CMD_Pos            _UINT32_(16)                                         /* (FUSES_IDAU_CTRL_EN) IDAU Enable Command Register Position */
#define FUSES_IDAU_CTRL_EN_CMD_Msk            (_UINT32_(0xFFFF) << FUSES_IDAU_CTRL_EN_CMD_Pos)     /* (FUSES_IDAU_CTRL_EN) IDAU Enable Command Register Mask */
#define FUSES_IDAU_CTRL_EN_CMD(value)         (FUSES_IDAU_CTRL_EN_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_CTRL_EN_CMD_Pos)) /* Assignment of value for CMD in the FUSES_IDAU_CTRL_EN register */
#define   FUSES_IDAU_CTRL_EN_CMD_ENABLE_Val   _UINT32_(0xA501)                                     /* (FUSES_IDAU_CTRL_EN) Module Enable  */
#define   FUSES_IDAU_CTRL_EN_CMD_DISABLE_Val  _UINT32_(0xA502)                                     /* (FUSES_IDAU_CTRL_EN) Module Disable  */
#define FUSES_IDAU_CTRL_EN_CMD_ENABLE         (FUSES_IDAU_CTRL_EN_CMD_ENABLE_Val << FUSES_IDAU_CTRL_EN_CMD_Pos) /* (FUSES_IDAU_CTRL_EN) Module Enable Position */
#define FUSES_IDAU_CTRL_EN_CMD_DISABLE        (FUSES_IDAU_CTRL_EN_CMD_DISABLE_Val << FUSES_IDAU_CTRL_EN_CMD_Pos) /* (FUSES_IDAU_CTRL_EN) Module Disable Position */
#define FUSES_IDAU_CTRL_EN_Msk                _UINT32_(0xFFFF0000)                                 /* (FUSES_IDAU_CTRL_EN) Register Mask  */


/* -------- FUSES_IDAU_CTRL_WLCK : (FUSES Offset: 0x878) (R/W 32) Control -------- */
#define FUSES_IDAU_CTRL_WLCK_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_IDAU_CTRL_WLCK) Control  Reset Value */

#define FUSES_IDAU_CTRL_WLCK_CMD_Pos          _UINT32_(16)                                         /* (FUSES_IDAU_CTRL_WLCK) IDAU Write Lock Command Register Position */
#define FUSES_IDAU_CTRL_WLCK_CMD_Msk          (_UINT32_(0xFFFF) << FUSES_IDAU_CTRL_WLCK_CMD_Pos)   /* (FUSES_IDAU_CTRL_WLCK) IDAU Write Lock Command Register Mask */
#define FUSES_IDAU_CTRL_WLCK_CMD(value)       (FUSES_IDAU_CTRL_WLCK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_CTRL_WLCK_CMD_Pos)) /* Assignment of value for CMD in the FUSES_IDAU_CTRL_WLCK register */
#define   FUSES_IDAU_CTRL_WLCK_CMD_WLCK_Val   _UINT32_(0xA503)                                     /* (FUSES_IDAU_CTRL_WLCK) Write Lock  */
#define FUSES_IDAU_CTRL_WLCK_CMD_WLCK         (FUSES_IDAU_CTRL_WLCK_CMD_WLCK_Val << FUSES_IDAU_CTRL_WLCK_CMD_Pos) /* (FUSES_IDAU_CTRL_WLCK) Write Lock Position */
#define FUSES_IDAU_CTRL_WLCK_Msk              _UINT32_(0xFFFF0000)                                 /* (FUSES_IDAU_CTRL_WLCK) Register Mask  */


