Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
#define FUSES_FCR_CRP_BC1ARP_Pos              _UINT32_(0)                                          /* (FUSES_FCR_CRP) Panel 1 Read Protect BootCfg1A Position */
#define FUSES_FCR_CRP_BC1ARP_Msk              (_UINT32_(0x1) << FUSES_FCR_CRP_BC1ARP_Pos)          /* (FUSES_FCR_CRP) Panel 1 Read Protect BootCfg1A Mask */
#define FUSES_FCR_CRP_BC1ARP(value)           (FUSES_FCR_CRP_BC1ARP_Msk & (_UINT32_(value) << FUSES_FCR_CRP_BC1ARP_Pos)) /* Assignment of value for BC1ARP in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_BC1ARP_DISABLE_Val    _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled  */
#define   FUSES_FCR_CRP_BC1ARP_ENABLE_Val     _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled  */
#define FUSES_FCR_CRP_BC1ARP_DISABLE          (FUSES_FCR_CRP_BC1ARP_DISABLE_Val << FUSES_FCR_CRP_BC1ARP_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled Position */
#define FUSES_FCR_CRP_BC1ARP_ENABLE           (FUSES_FCR_CRP_BC1ARP_ENABLE_Val << FUSES_FCR_CRP_BC1ARP_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled Position */
#define FUSES_FCR_CRP_BC1RP_Pos               _UINT32_(2)                                          /* (FUSES_FCR_CRP) Panel 1 Read Protect BootCfg1 Position */
#define FUSES_FCR_CRP_BC1RP_Msk               (_UINT32_(0x1) << FUSES_FCR_CRP_BC1RP_Pos)           /* (FUSES_FCR_CRP) Panel 1 Read Protect BootCfg1 Mask */
#define FUSES_FCR_CRP_BC1RP(value)            (FUSES_FCR_CRP_BC1RP_Msk & (_UINT32_(value) << FUSES_FCR_CRP_BC1RP_Pos)) /* Assignment of value for BC1RP in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_BC1RP_DISABLE_Val     _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled  */
#define   FUSES_FCR_CRP_BC1RP_ENABLE_Val      _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled  */
#define FUSES_FCR_CRP_BC1RP_DISABLE           (FUSES_FCR_CRP_BC1RP_DISABLE_Val << FUSES_FCR_CRP_BC1RP_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled Position */
#define FUSES_FCR_CRP_BC1RP_ENABLE            (FUSES_FCR_CRP_BC1RP_ENABLE_Val << FUSES_FCR_CRP_BC1RP_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled Position */
#define FUSES_FCR_CRP_RCRP_Pos                _UINT32_(3)                                          /* (FUSES_FCR_CRP) Panel 1 Read Protect ROMCfg Position */
#define FUSES_FCR_CRP_RCRP_Msk                (_UINT32_(0x1) << FUSES_FCR_CRP_RCRP_Pos)            /* (FUSES_FCR_CRP) Panel 1 Read Protect ROMCfg Mask */
#define FUSES_FCR_CRP_RCRP(value)             (FUSES_FCR_CRP_RCRP_Msk & (_UINT32_(value) << FUSES_FCR_CRP_RCRP_Pos)) /* Assignment of value for RCRP in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_RCRP_DISABLE_Val      _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled  */
#define   FUSES_FCR_CRP_RCRP_ENABLE_Val       _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled  */
#define FUSES_FCR_CRP_RCRP_DISABLE            (FUSES_FCR_CRP_RCRP_DISABLE_Val << FUSES_FCR_CRP_RCRP_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled Position */
#define FUSES_FCR_CRP_RCRP_ENABLE             (FUSES_FCR_CRP_RCRP_ENABLE_Val << FUSES_FCR_CRP_RCRP_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled Position */
#define FUSES_FCR_CRP_VSSRP0_Pos              _UINT32_(4)                                          /* (FUSES_FCR_CRP) Panel 1 Read Protect VSSn Position */
#define FUSES_FCR_CRP_VSSRP0_Msk              (_UINT32_(0x1) << FUSES_FCR_CRP_VSSRP0_Pos)          /* (FUSES_FCR_CRP) Panel 1 Read Protect VSSn Mask */
#define FUSES_FCR_CRP_VSSRP0(value)           (FUSES_FCR_CRP_VSSRP0_Msk & (_UINT32_(value) << FUSES_FCR_CRP_VSSRP0_Pos)) /* Assignment of value for VSSRP0 in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_VSSRP0_DISABLE_Val    _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled  */
#define   FUSES_FCR_CRP_VSSRP0_ENABLE_Val     _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled  */
#define FUSES_FCR_CRP_VSSRP0_DISABLE          (FUSES_FCR_CRP_VSSRP0_DISABLE_Val << FUSES_FCR_CRP_VSSRP0_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled Position */
#define FUSES_FCR_CRP_VSSRP0_ENABLE           (FUSES_FCR_CRP_VSSRP0_ENABLE_Val << FUSES_FCR_CRP_VSSRP0_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled Position */
#define FUSES_FCR_CRP_VSSRP1_Pos              _UINT32_(5)                                          /* (FUSES_FCR_CRP) Panel 1 Read Protect VSSn Position */
#define FUSES_FCR_CRP_VSSRP1_Msk              (_UINT32_(0x1) << FUSES_FCR_CRP_VSSRP1_Pos)          /* (FUSES_FCR_CRP) Panel 1 Read Protect VSSn Mask */
#define FUSES_FCR_CRP_VSSRP1(value)           (FUSES_FCR_CRP_VSSRP1_Msk & (_UINT32_(value) << FUSES_FCR_CRP_VSSRP1_Pos)) /* Assignment of value for VSSRP1 in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_VSSRP1_DISABLE_Val    _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled  */
#define   FUSES_FCR_CRP_VSSRP1_ENABLE_Val     _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled  */
#define FUSES_FCR_CRP_VSSRP1_DISABLE          (FUSES_FCR_CRP_VSSRP1_DISABLE_Val << FUSES_FCR_CRP_VSSRP1_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Disabled Position */
#define FUSES_FCR_CRP_VSSRP1_ENABLE           (FUSES_FCR_CRP_VSSRP1_ENABLE_Val << FUSES_FCR_CRP_VSSRP1_Pos) /* (FUSES_FCR_CRP) Read Protection for this Page is Enabled Position */
#define FUSES_FCR_CRP_BC1ARPLOCK_Pos          _UINT32_(16)                                         /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection BootCfg1A Position */
#define FUSES_FCR_CRP_BC1ARPLOCK_Msk          (_UINT32_(0x1) << FUSES_FCR_CRP_BC1ARPLOCK_Pos)      /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection BootCfg1A Mask */
#define FUSES_FCR_CRP_BC1ARPLOCK(value)       (FUSES_FCR_CRP_BC1ARPLOCK_Msk & (_UINT32_(value) << FUSES_FCR_CRP_BC1ARPLOCK_Pos)) /* Assignment of value for BC1ARPLOCK in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_BC1ARPLOCK_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCR_CRP_BC1ARPLOCK_LOCKED_Val _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCR_CRP_BC1ARPLOCK_UNLOCKED     (FUSES_FCR_CRP_BC1ARPLOCK_UNLOCKED_Val << FUSES_FCR_CRP_BC1ARPLOCK_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCR_CRP_BC1ARPLOCK_LOCKED       (FUSES_FCR_CRP_BC1ARPLOCK_LOCKED_Val << FUSES_FCR_CRP_BC1ARPLOCK_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCR_CRP_BC1RPLOCK_Pos           _UINT32_(18)                                         /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection BootCfg1 Position */
#define FUSES_FCR_CRP_BC1RPLOCK_Msk           (_UINT32_(0x1) << FUSES_FCR_CRP_BC1RPLOCK_Pos)       /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection BootCfg1 Mask */
#define FUSES_FCR_CRP_BC1RPLOCK(value)        (FUSES_FCR_CRP_BC1RPLOCK_Msk & (_UINT32_(value) << FUSES_FCR_CRP_BC1RPLOCK_Pos)) /* Assignment of value for BC1RPLOCK in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_BC1RPLOCK_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCR_CRP_BC1RPLOCK_LOCKED_Val  _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCR_CRP_BC1RPLOCK_UNLOCKED      (FUSES_FCR_CRP_BC1RPLOCK_UNLOCKED_Val << FUSES_FCR_CRP_BC1RPLOCK_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCR_CRP_BC1RPLOCK_LOCKED        (FUSES_FCR_CRP_BC1RPLOCK_LOCKED_Val << FUSES_FCR_CRP_BC1RPLOCK_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCR_CRP_RCRPLOCK_Pos            _UINT32_(19)                                         /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection ROMCfg Position */
#define FUSES_FCR_CRP_RCRPLOCK_Msk            (_UINT32_(0x1) << FUSES_FCR_CRP_RCRPLOCK_Pos)        /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection ROMCfg Mask */
#define FUSES_FCR_CRP_RCRPLOCK(value)         (FUSES_FCR_CRP_RCRPLOCK_Msk & (_UINT32_(value) << FUSES_FCR_CRP_RCRPLOCK_Pos)) /* Assignment of value for RCRPLOCK in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_RCRPLOCK_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCR_CRP_RCRPLOCK_LOCKED_Val   _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCR_CRP_RCRPLOCK_UNLOCKED       (FUSES_FCR_CRP_RCRPLOCK_UNLOCKED_Val << FUSES_FCR_CRP_RCRPLOCK_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCR_CRP_RCRPLOCK_LOCKED         (FUSES_FCR_CRP_RCRPLOCK_LOCKED_Val << FUSES_FCR_CRP_RCRPLOCK_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCR_CRP_VSSRPLOCK0_Pos          _UINT32_(20)                                         /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection VSSn Position */
#define FUSES_FCR_CRP_VSSRPLOCK0_Msk          (_UINT32_(0x1) << FUSES_FCR_CRP_VSSRPLOCK0_Pos)      /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection VSSn Mask */
#define FUSES_FCR_CRP_VSSRPLOCK0(value)       (FUSES_FCR_CRP_VSSRPLOCK0_Msk & (_UINT32_(value) << FUSES_FCR_CRP_VSSRPLOCK0_Pos)) /* Assignment of value for VSSRPLOCK0 in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_VSSRPLOCK0_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCR_CRP_VSSRPLOCK0_LOCKED_Val _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCR_CRP_VSSRPLOCK0_UNLOCKED     (FUSES_FCR_CRP_VSSRPLOCK0_UNLOCKED_Val << FUSES_FCR_CRP_VSSRPLOCK0_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCR_CRP_VSSRPLOCK0_LOCKED       (FUSES_FCR_CRP_VSSRPLOCK0_LOCKED_Val << FUSES_FCR_CRP_VSSRPLOCK0_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCR_CRP_VSSRPLOCK1_Pos          _UINT32_(21)                                         /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection VSSn Position */
#define FUSES_FCR_CRP_VSSRPLOCK1_Msk          (_UINT32_(0x1) << FUSES_FCR_CRP_VSSRPLOCK1_Pos)      /* (FUSES_FCR_CRP) Panel 1 Lock Read Protection VSSn Mask */
#define FUSES_FCR_CRP_VSSRPLOCK1(value)       (FUSES_FCR_CRP_VSSRPLOCK1_Msk & (_UINT32_(value) << FUSES_FCR_CRP_VSSRPLOCK1_Pos)) /* Assignment of value for VSSRPLOCK1 in the FUSES_FCR_CRP register */
#define   FUSES_FCR_CRP_VSSRPLOCK1_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCR_CRP_VSSRPLOCK1_LOCKED_Val _UINT32_(0x1)                                        /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCR_CRP_VSSRPLOCK1_UNLOCKED     (FUSES_FCR_CRP_VSSRPLOCK1_UNLOCKED_Val << FUSES_FCR_CRP_VSSRPLOCK1_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCR_CRP_VSSRPLOCK1_LOCKED       (FUSES_FCR_CRP_VSSRPLOCK1_LOCKED_Val << FUSES_FCR_CRP_VSSRPLOCK1_Pos) /* (FUSES_FCR_CRP) The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCR_CRP_Msk                     _UINT32_(0x003D003D)                                 /* (FUSES_FCR_CRP) Register Mask  */

#define FUSES_FCR_CRP_VSSRP_Pos               _UINT32_(4)                                          /* (FUSES_FCR_CRP Position) Panel x Read Protect VSSn */
#define FUSES_FCR_CRP_VSSRP_Msk               (_UINT32_(0x3) << FUSES_FCR_CRP_VSSRP_Pos)           /* (FUSES_FCR_CRP Mask) VSSRP */
#define FUSES_FCR_CRP_VSSRP(value)            (FUSES_FCR_CRP_VSSRP_Msk & (_UINT32_(value) << FUSES_FCR_CRP_VSSRP_Pos)) 
#define FUSES_FCR_CRP_VSSRPLOCK_Pos           _UINT32_(20)                                         /* (FUSES_FCR_CRP Position) Panel x Lock Read Protection VSSn */
#define FUSES_FCR_CRP_VSSRPLOCK_Msk           (_UINT32_(0x3) << FUSES_FCR_CRP_VSSRPLOCK_Pos)       /* (FUSES_FCR_CRP Mask) VSSRPLOCK */
#define FUSES_FCR_CRP_VSSRPLOCK(value)        (FUSES_FCR_CRP_VSSRPLOCK_Msk & (_UINT32_(value) << FUSES_FCR_CRP_VSSRPLOCK_Pos)) 

/* -------- FUSES_FCR_ECCCTRL : (FUSES Offset: 0x884) (R/W 32) ECC Control REGISTER -------- */
#define FUSES_FCR_ECCCTRL_RESETVALUE          _UINT32_(0x70)                                       /*  (FUSES_FCR_ECCCTRL) ECC Control REGISTER  Reset Value */

#define FUSES_FCR_ECCCTRL_ECCCTL_Pos          _UINT32_(4)                                          /* (FUSES_FCR_ECCCTRL) NVM ECC Mode Control - restricts one or more NVMOPs Position */
#define FUSES_FCR_ECCCTRL_ECCCTL_Msk          (_UINT32_(0x3) << FUSES_FCR_ECCCTRL_ECCCTL_Pos)      /* (FUSES_FCR_ECCCTRL) NVM ECC Mode Control - restricts one or more NVMOPs Mask */
#define FUSES_FCR_ECCCTRL_ECCCTL(value)       (FUSES_FCR_ECCCTRL_ECCCTL_Msk & (_UINT32_(value) << FUSES_FCR_ECCCTRL_ECCCTL_Pos)) /* Assignment of value for ECCCTL in the FUSES_FCR_ECCCTRL register */
#define   FUSES_FCR_ECCCTRL_ECCCTL_STRICT_Val _UINT32_(0x0)                                        /* (FUSES_FCR_ECCCTRL) ECC Writes with ECC Reads (NVMOP = Single Program Operation disabled)  */
#define   FUSES_FCR_ECCCTRL_ECCCTL_DYNAMIC_Val _UINT32_(0x1)                                        /* (FUSES_FCR_ECCCTRL) Dynamic Writes with Dynamic Reads  */
#define   FUSES_FCR_ECCCTRL_ECCCTL_ECC_Val    _UINT32_(0x2)                                        /* (FUSES_FCR_ECCCTRL) ECC Writes with Dynamic Reads (NVMOP = Single Program Operation disabled)  */
#define   FUSES_FCR_ECCCTRL_ECCCTL_DISABLE_Val _UINT32_(0x3)                                        /* (FUSES_FCR_ECCCTRL) Dynamic Writes with No Error Check Reads  */
#define FUSES_FCR_ECCCTRL_ECCCTL_STRICT       (FUSES_FCR_ECCCTRL_ECCCTL_STRICT_Val << FUSES_FCR_ECCCTRL_ECCCTL_Pos) /* (FUSES_FCR_ECCCTRL) ECC Writes with ECC Reads (NVMOP = Single Program Operation disabled) Position */
#define FUSES_FCR_ECCCTRL_ECCCTL_DYNAMIC      (FUSES_FCR_ECCCTRL_ECCCTL_DYNAMIC_Val << FUSES_FCR_ECCCTRL_ECCCTL_Pos) /* (FUSES_FCR_ECCCTRL) Dynamic Writes with Dynamic Reads Position */
#define FUSES_FCR_ECCCTRL_ECCCTL_ECC          (FUSES_FCR_ECCCTRL_ECCCTL_ECC_Val << FUSES_FCR_ECCCTRL_ECCCTL_Pos) /* (FUSES_FCR_ECCCTRL) ECC Writes with Dynamic Reads (NVMOP = Single Program Operation disabled) Position */
#define FUSES_FCR_ECCCTRL_ECCCTL_DISABLE      (FUSES_FCR_ECCCTRL_ECCCTL_DISABLE_Val << FUSES_FCR_ECCCTRL_ECCCTL_Pos) /* (FUSES_FCR_ECCCTRL) Dynamic Writes with No Error Check Reads Position */
#define FUSES_FCR_ECCCTRL_ECCUNLCK_Pos        _UINT32_(6)                                          /* (FUSES_FCR_ECCCTRL) NVM ECC Mode Control Unlock Position */
#define FUSES_FCR_ECCCTRL_ECCUNLCK_Msk        (_UINT32_(0x1) << FUSES_FCR_ECCCTRL_ECCUNLCK_Pos)    /* (FUSES_FCR_ECCCTRL) NVM ECC Mode Control Unlock Mask */
#define FUSES_FCR_ECCCTRL_ECCUNLCK(value)     (FUSES_FCR_ECCCTRL_ECCUNLCK_Msk & (_UINT32_(value) << FUSES_FCR_ECCCTRL_ECCUNLCK_Pos)) /* Assignment of value for ECCUNLCK in the FUSES_FCR_ECCCTRL register */
#define   FUSES_FCR_ECCCTRL_ECCUNLCK_LOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCR_ECCCTRL) ECCUNLCK and ECCCTL[1:0] cannot be written  */
#define   FUSES_FCR_ECCCTRL_ECCUNLCK_UNLOCKED_Val _UINT32_(0x1)                                        /* (FUSES_FCR_ECCCTRL) ECCUNLCK and ECCCTL[1:0] can be written  */
#define FUSES_FCR_ECCCTRL_ECCUNLCK_LOCKED     (FUSES_FCR_ECCCTRL_ECCUNLCK_LOCKED_Val << FUSES_FCR_ECCCTRL_ECCUNLCK_Pos) /* (FUSES_FCR_ECCCTRL) ECCUNLCK and ECCCTL[1:0] cannot be written Position */
#define FUSES_FCR_ECCCTRL_ECCUNLCK_UNLOCKED   (FUSES_FCR_ECCCTRL_ECCUNLCK_UNLOCKED_Val << FUSES_FCR_ECCCTRL_ECCUNLCK_Pos) /* (FUSES_FCR_ECCCTRL) ECCUNLCK and ECCCTL[1:0] can be written Position */
#define FUSES_FCR_ECCCTRL_SECCNT_Pos          _UINT32_(8)                                          /* (FUSES_FCR_ECCCTRL) Flash SEC Count Position */
#define FUSES_FCR_ECCCTRL_SECCNT_Msk          (_UINT32_(0xFF) << FUSES_FCR_ECCCTRL_SECCNT_Pos)     /* (FUSES_FCR_ECCCTRL) Flash SEC Count Mask */
#define FUSES_FCR_ECCCTRL_SECCNT(value)       (FUSES_FCR_ECCCTRL_SECCNT_Msk & (_UINT32_(value) << FUSES_FCR_ECCCTRL_SECCNT_Pos)) /* Assignment of value for SECCNT in the FUSES_FCR_ECCCTRL register */
#define FUSES_FCR_ECCCTRL_Msk                 _UINT32_(0x0000FF70)                                 /* (FUSES_FCR_ECCCTRL) Register Mask  */


/* -------- FUSES_SUPC_BRCFGUSMOR_BOR : (FUSES Offset: 0x888) (R/W 32) Boot Rom Configurable SMOR User CFG BOR register -------- */
#define FUSES_SUPC_BRCFGUSMOR_BOR_RESETVALUE  _UINT32_(0x00)                                       /*  (FUSES_SUPC_BRCFGUSMOR_BOR) Boot Rom Configurable SMOR User CFG BOR register  Reset Value */

#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_Pos _UINT32_(0)                                          /* (FUSES_SUPC_BRCFGUSMOR_BOR) Refer to pwr_smor_[nn]_v2 DOS document for details. Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_Msk (_UINT32_(0x1) << FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) Refer to pwr_smor_[nn]_v2 DOS document for details. Mask */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO(value) (FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_Msk & (_UINT32_(value) << FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_Pos)) /* Assignment of value for HYST_BOR_VDDIO in the FUSES_SUPC_BRCFGUSMOR_BOR register */
#define   FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_LOW_Val _UINT32_(0x0)                                        /* (FUSES_SUPC_BRCFGUSMOR_BOR) Low Hysteresis (default)  */
#define   FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_HIGH_Val _UINT32_(0x1)                                        /* (FUSES_SUPC_BRCFGUSMOR_BOR) High Hysteresis  */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_LOW (FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_LOW_Val << FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) Low Hysteresis (default) Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_HIGH (FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_HIGH_Val << FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDIO_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) High Hysteresis Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Pos _UINT32_(1)                                          /* (FUSES_SUPC_BRCFGUSMOR_BOR) Nominal BOR Trip, Refer to pwr_smor_[nn]_v2 DOS document for details. Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Msk (_UINT32_(0x3) << FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) Nominal BOR Trip, Refer to pwr_smor_[nn]_v2 DOS document for details. Mask */
#define FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO(value) (FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Msk & (_UINT32_(value) << FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Pos)) /* Assignment of value for BOR_TRIP_VDDIO in the FUSES_SUPC_BRCFGUSMOR_BOR register */
#define   FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_0_Val _UINT32_(0x0)                                        /* (FUSES_SUPC_BRCFGUSMOR_BOR) 1.68V (default)  */
#define   FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_1_Val _UINT32_(0x1)                                        /* (FUSES_SUPC_BRCFGUSMOR_BOR) 2.2V  */
#define   FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_2_Val _UINT32_(0x2)                                        /* (FUSES_SUPC_BRCFGUSMOR_BOR) 2.64V  */
#define   FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_3_Val _UINT32_(0x3)                                        /* (FUSES_SUPC_BRCFGUSMOR_BOR) 2.93V  */
#define FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_0 (FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_0_Val << FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) 1.68V (default) Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_1 (FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_1_Val << FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) 2.2V Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_2 (FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_2_Val << FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) 2.64V Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_3 (FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_3_Val << FUSES_SUPC_BRCFGUSMOR_BOR_BOR_TRIP_VDDIO_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) 2.93V Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_Pos _UINT32_(10)                                         /* (FUSES_SUPC_BRCFGUSMOR_BOR) Refer to pwr_smor_[nn]_v2 DOS document for details. Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_Msk (_UINT32_(0x1) << FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) Refer to pwr_smor_[nn]_v2 DOS document for details. Mask */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG(value) (FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_Msk & (_UINT32_(value) << FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_Pos)) /* Assignment of value for HYST_BOR_VDDREG in the FUSES_SUPC_BRCFGUSMOR_BOR register */
#define   FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_LOW_Val _UINT32_(0x0)                                        /* (FUSES_SUPC_BRCFGUSMOR_BOR) Low Hysteresis (default)  */
#define   FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_HIGH_Val _UINT32_(0x1)                                        /* (FUSES_SUPC_BRCFGUSMOR_BOR) High Hysteresis  */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_LOW (FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_LOW_Val << FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) Low Hysteresis (default) Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_HIGH (FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_HIGH_Val << FUSES_SUPC_BRCFGUSMOR_BOR_HYST_BOR_VDDREG_Pos) /* (FUSES_SUPC_BRCFGUSMOR_BOR) High Hysteresis Position */
#define FUSES_SUPC_BRCFGUSMOR_BOR_Msk         _UINT32_(0x00000407)                                 /* (FUSES_SUPC_BRCFGUSMOR_BOR) Register Mask  */


