Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
/* -------- FUSES_F1RR : (FUSES Offset: 0x00) ( R/ 32) PANEL 0 REDUNDANCY RECORD 1-0 Register -------- */
#define FUSES_F1RR_RR0ADDR_Pos                _UINT32_(0)                                          /* (FUSES_F1RR) Redundancy Replaced Page Address Position */
#define FUSES_F1RR_RR0ADDR_Msk                (_UINT32_(0x7F) << FUSES_F1RR_RR0ADDR_Pos)           /* (FUSES_F1RR) Redundancy Replaced Page Address Mask */
#define FUSES_F1RR_RR0ADDR(value)             (FUSES_F1RR_RR0ADDR_Msk & (_UINT32_(value) << FUSES_F1RR_RR0ADDR_Pos)) /* Assignment of value for RR0ADDR in the FUSES_F1RR register */
#define FUSES_F1RR_RR0DIS_Pos                 _UINT32_(15)                                         /* (FUSES_F1RR) Redundancy Record 0 enabled Position */
#define FUSES_F1RR_RR0DIS_Msk                 (_UINT32_(0x1) << FUSES_F1RR_RR0DIS_Pos)             /* (FUSES_F1RR) Redundancy Record 0 enabled Mask */
#define FUSES_F1RR_RR0DIS(value)              (FUSES_F1RR_RR0DIS_Msk & (_UINT32_(value) << FUSES_F1RR_RR0DIS_Pos)) /* Assignment of value for RR0DIS in the FUSES_F1RR register */
#define   FUSES_F1RR_RR0DIS_0_Val             _UINT32_(0x0)                                        /* (FUSES_F1RR) FCR maps the redundant page 0 into the address defined by RR0ADDR  */
#define   FUSES_F1RR_RR0DIS_1_Val             _UINT32_(0x1)                                        /* (FUSES_F1RR) Redundant page 0 mapping is Disabled  */
#define FUSES_F1RR_RR0DIS_0                   (FUSES_F1RR_RR0DIS_0_Val << FUSES_F1RR_RR0DIS_Pos)   /* (FUSES_F1RR) FCR maps the redundant page 0 into the address defined by RR0ADDR Position */
#define FUSES_F1RR_RR0DIS_1                   (FUSES_F1RR_RR0DIS_1_Val << FUSES_F1RR_RR0DIS_Pos)   /* (FUSES_F1RR) Redundant page 0 mapping is Disabled Position */
#define FUSES_F1RR_RR1ADDR_Pos                _UINT32_(16)                                         /* (FUSES_F1RR) Redundancy Replaced Page Address Position */
#define FUSES_F1RR_RR1ADDR_Msk                (_UINT32_(0x7F) << FUSES_F1RR_RR1ADDR_Pos)           /* (FUSES_F1RR) Redundancy Replaced Page Address Mask */
#define FUSES_F1RR_RR1ADDR(value)             (FUSES_F1RR_RR1ADDR_Msk & (_UINT32_(value) << FUSES_F1RR_RR1ADDR_Pos)) /* Assignment of value for RR1ADDR in the FUSES_F1RR register */
#define FUSES_F1RR_RR1DIS_Pos                 _UINT32_(31)                                         /* (FUSES_F1RR) Redundancy Record 1 enabled Position */
#define FUSES_F1RR_RR1DIS_Msk                 (_UINT32_(0x1) << FUSES_F1RR_RR1DIS_Pos)             /* (FUSES_F1RR) Redundancy Record 1 enabled Mask */
#define FUSES_F1RR_RR1DIS(value)              (FUSES_F1RR_RR1DIS_Msk & (_UINT32_(value) << FUSES_F1RR_RR1DIS_Pos)) /* Assignment of value for RR1DIS in the FUSES_F1RR register */
#define   FUSES_F1RR_RR1DIS_0_Val             _UINT32_(0x0)                                        /* (FUSES_F1RR) FCR maps the redundant page 1 into the address defined by RR1ADDR  */
#define   FUSES_F1RR_RR1DIS_1_Val             _UINT32_(0x1)                                        /* (FUSES_F1RR) Redundant page 1 mapping is Disabled  */
#define FUSES_F1RR_RR1DIS_0                   (FUSES_F1RR_RR1DIS_0_Val << FUSES_F1RR_RR1DIS_Pos)   /* (FUSES_F1RR) FCR maps the redundant page 1 into the address defined by RR1ADDR Position */
#define FUSES_F1RR_RR1DIS_1                   (FUSES_F1RR_RR1DIS_1_Val << FUSES_F1RR_RR1DIS_Pos)   /* (FUSES_F1RR) Redundant page 1 mapping is Disabled Position */
#define FUSES_F1RR_Msk                        _UINT32_(0x807F807F)                                 /* (FUSES_F1RR) Register Mask  */


/* -------- FUSES_FCCFG0 : (FUSES Offset: 0x80) ( R/ 32) Calibration Configuration 0 Register -------- */
#define FUSES_FCCFG0_CFG_SMOR0_Pos            _UINT32_(0)                                          /* (FUSES_FCCFG0) SMOR configuration bits Position */
#define FUSES_FCCFG0_CFG_SMOR0_Msk            (_UINT32_(0xFFFFFFFF) << FUSES_FCCFG0_CFG_SMOR0_Pos) /* (FUSES_FCCFG0) SMOR configuration bits Mask */
#define FUSES_FCCFG0_CFG_SMOR0(value)         (FUSES_FCCFG0_CFG_SMOR0_Msk & (_UINT32_(value) << FUSES_FCCFG0_CFG_SMOR0_Pos)) /* Assignment of value for CFG_SMOR0 in the FUSES_FCCFG0 register */
#define FUSES_FCCFG0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FCCFG0) Register Mask  */


/* -------- FUSES_FCCFG1 : (FUSES Offset: 0x84) ( R/ 32) Calibration Configuration 1 Register -------- */
#define FUSES_FCCFG1_CFG_SMOR1_Pos            _UINT32_(0)                                          /* (FUSES_FCCFG1) SMOR configuration bits Position */
#define FUSES_FCCFG1_CFG_SMOR1_Msk            (_UINT32_(0xFFFFFFFF) << FUSES_FCCFG1_CFG_SMOR1_Pos) /* (FUSES_FCCFG1) SMOR configuration bits Mask */
#define FUSES_FCCFG1_CFG_SMOR1(value)         (FUSES_FCCFG1_CFG_SMOR1_Msk & (_UINT32_(value) << FUSES_FCCFG1_CFG_SMOR1_Pos)) /* Assignment of value for CFG_SMOR1 in the FUSES_FCCFG1 register */
#define FUSES_FCCFG1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FCCFG1) Register Mask  */


/* -------- FUSES_FCCFG8 : (FUSES Offset: 0xA0) ( R/ 32) Calibration Configuration 8 Register -------- */
#define FUSES_FCCFG8_CFG_DS_SMOR_REF_Pos      _UINT32_(0)                                          /* (FUSES_FCCFG8) DSSMOR configuration bits Position */
#define FUSES_FCCFG8_CFG_DS_SMOR_REF_Msk      (_UINT32_(0xFFFF) << FUSES_FCCFG8_CFG_DS_SMOR_REF_Pos) /* (FUSES_FCCFG8) DSSMOR configuration bits Mask */
#define FUSES_FCCFG8_CFG_DS_SMOR_REF(value)   (FUSES_FCCFG8_CFG_DS_SMOR_REF_Msk & (_UINT32_(value) << FUSES_FCCFG8_CFG_DS_SMOR_REF_Pos)) /* Assignment of value for CFG_DS_SMOR_REF in the FUSES_FCCFG8 register */
#define FUSES_FCCFG8_CFG_DS_SMOR_CLK_Pos      _UINT32_(16)                                         /* (FUSES_FCCFG8) DSSMOR configuration bits Position */
#define FUSES_FCCFG8_CFG_DS_SMOR_CLK_Msk      (_UINT32_(0xFFFF) << FUSES_FCCFG8_CFG_DS_SMOR_CLK_Pos) /* (FUSES_FCCFG8) DSSMOR configuration bits Mask */
#define FUSES_FCCFG8_CFG_DS_SMOR_CLK(value)   (FUSES_FCCFG8_CFG_DS_SMOR_CLK_Msk & (_UINT32_(value) << FUSES_FCCFG8_CFG_DS_SMOR_CLK_Pos)) /* Assignment of value for CFG_DS_SMOR_CLK in the FUSES_FCCFG8 register */
#define FUSES_FCCFG8_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FCCFG8) Register Mask  */


/* -------- FUSES_FCCFG16 : (FUSES Offset: 0xC0) ( R/ 32) Calibration Configuration 16 Register -------- */
#define FUSES_FCCFG16_CFG_DFLL48M_Pos         _UINT32_(0)                                          /* (FUSES_FCCFG16) Comparator configuration bits Position */
#define FUSES_FCCFG16_CFG_DFLL48M_Msk         (_UINT32_(0xFFFFFFFF) << FUSES_FCCFG16_CFG_DFLL48M_Pos) /* (FUSES_FCCFG16) Comparator configuration bits Mask */
#define FUSES_FCCFG16_CFG_DFLL48M(value)      (FUSES_FCCFG16_CFG_DFLL48M_Msk & (_UINT32_(value) << FUSES_FCCFG16_CFG_DFLL48M_Pos)) /* Assignment of value for CFG_DFLL48M in the FUSES_FCCFG16 register */
#define FUSES_FCCFG16_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FCCFG16) Register Mask  */


/* -------- FUSES_FCCFG17 : (FUSES Offset: 0xC4) ( R/ 32) Calibration Configuration 17 Register -------- */
#define FUSES_FCCFG17_CFG_XTAL_HF_Pos         _UINT32_(0)                                          /* (FUSES_FCCFG17) Crystal Oscillator calibration configuration bits Position */
#define FUSES_FCCFG17_CFG_XTAL_HF_Msk         (_UINT32_(0xFFFF) << FUSES_FCCFG17_CFG_XTAL_HF_Pos)  /* (FUSES_FCCFG17) Crystal Oscillator calibration configuration bits Mask */
#define FUSES_FCCFG17_CFG_XTAL_HF(value)      (FUSES_FCCFG17_CFG_XTAL_HF_Msk & (_UINT32_(value) << FUSES_FCCFG17_CFG_XTAL_HF_Pos)) /* Assignment of value for CFG_XTAL_HF in the FUSES_FCCFG17 register */
#define FUSES_FCCFG17_Msk                     _UINT32_(0x0000FFFF)                                 /* (FUSES_FCCFG17) Register Mask  */


/* -------- FUSES_FCCFG24 : (FUSES Offset: 0xE0) ( R/ 32) Calibration Configuration 24 Register -------- */
#define FUSES_FCCFG24_CFG_CALVREGSW0_Pos      _UINT32_(0)                                          /* (FUSES_FCCFG24) 99 ma VREG Calibration configuration bits Position */
#define FUSES_FCCFG24_CFG_CALVREGSW0_Msk      (_UINT32_(0xFFFF) << FUSES_FCCFG24_CFG_CALVREGSW0_Pos) /* (FUSES_FCCFG24) 99 ma VREG Calibration configuration bits Mask */
#define FUSES_FCCFG24_CFG_CALVREGSW0(value)   (FUSES_FCCFG24_CFG_CALVREGSW0_Msk & (_UINT32_(value) << FUSES_FCCFG24_CFG_CALVREGSW0_Pos)) /* Assignment of value for CFG_CALVREGSW0 in the FUSES_FCCFG24 register */
#define FUSES_FCCFG24_Msk                     _UINT32_(0x0000FFFF)                                 /* (FUSES_FCCFG24) Register Mask  */


/* -------- FUSES_FCCFG27 : (FUSES Offset: 0xEC) ( R/ 32) Calibration Configuration 27 Register -------- */
#define FUSES_FCCFG27_CFG_CALVREGRAM_Pos      _UINT32_(16)                                         /* (FUSES_FCCFG27) 50 ma VREG Calibration configuration bits Position */
#define FUSES_FCCFG27_CFG_CALVREGRAM_Msk      (_UINT32_(0xFFFF) << FUSES_FCCFG27_CFG_CALVREGRAM_Pos) /* (FUSES_FCCFG27) 50 ma VREG Calibration configuration bits Mask */
#define FUSES_FCCFG27_CFG_CALVREGRAM(value)   (FUSES_FCCFG27_CFG_CALVREGRAM_Msk & (_UINT32_(value) << FUSES_FCCFG27_CFG_CALVREGRAM_Pos)) /* Assignment of value for CFG_CALVREGRAM in the FUSES_FCCFG27 register */
#define FUSES_FCCFG27_Msk                     _UINT32_(0xFFFF0000)                                 /* (FUSES_FCCFG27) Register Mask  */


/* -------- FUSES_FCCFG28 : (FUSES Offset: 0xF0) ( R/ 32) Calibration Configuration 28 Register -------- */
#define FUSES_FCCFG28_CALCP_Pos               _UINT32_(0)                                          /* (FUSES_FCCFG28) Charge Pump Calibration  configuration bits for all charge pumps Position */
#define FUSES_FCCFG28_CALCP_Msk               (_UINT32_(0xF) << FUSES_FCCFG28_CALCP_Pos)           /* (FUSES_FCCFG28) Charge Pump Calibration  configuration bits for all charge pumps Mask */
#define FUSES_FCCFG28_CALCP(value)            (FUSES_FCCFG28_CALCP_Msk & (_UINT32_(value) << FUSES_FCCFG28_CALCP_Pos)) /* Assignment of value for CALCP in the FUSES_FCCFG28 register */
#define FUSES_FCCFG28_CALSUPC_Pos             _UINT32_(8)                                          /* (FUSES_FCCFG28) RPMU / SUPC configuration bits Position */
#define FUSES_FCCFG28_CALSUPC_Msk             (_UINT32_(0xFF) << FUSES_FCCFG28_CALSUPC_Pos)        /* (FUSES_FCCFG28) RPMU / SUPC configuration bits Mask */
#define FUSES_FCCFG28_CALSUPC(value)          (FUSES_FCCFG28_CALSUPC_Msk & (_UINT32_(value) << FUSES_FCCFG28_CALSUPC_Pos)) /* Assignment of value for CALSUPC in the FUSES_FCCFG28 register */
#define FUSES_FCCFG28_Msk                     _UINT32_(0x0000FF0F)                                 /* (FUSES_FCCFG28) Register Mask  */


/* -------- FUSES_FCCFG29 : (FUSES Offset: 0xF4) ( R/ 32) Calibration Configuration 29 Register -------- */
#define FUSES_FCCFG29_CALUSERLDO_Pos          _UINT32_(0)                                          /* (FUSES_FCCFG29) User LDO Calibration  configuration bits Position */
#define FUSES_FCCFG29_CALUSERLDO_Msk          (_UINT32_(0xFF) << FUSES_FCCFG29_CALUSERLDO_Pos)     /* (FUSES_FCCFG29) User LDO Calibration  configuration bits Mask */
#define FUSES_FCCFG29_CALUSERLDO(value)       (FUSES_FCCFG29_CALUSERLDO_Msk & (_UINT32_(value) << FUSES_FCCFG29_CALUSERLDO_Pos)) /* Assignment of value for CALUSERLDO in the FUSES_FCCFG29 register */
#define FUSES_FCCFG29_Msk                     _UINT32_(0x000000FF)                                 /* (FUSES_FCCFG29) Register Mask  */


/* -------- FUSES_FCCFG32 : (FUSES Offset: 0x100) ( R/ 32) DSU Device Configuration 0 Register (DEVID) -------- */
#define FUSES_FCCFG32_PFM_SZ_Pos              _UINT32_(0)                                          /* (FUSES_FCCFG32) Program Flash Memory (PFM) Size on Device Position */
#define FUSES_FCCFG32_PFM_SZ_Msk              (_UINT32_(0xF) << FUSES_FCCFG32_PFM_SZ_Pos)          /* (FUSES_FCCFG32) Program Flash Memory (PFM) Size on Device Mask */
#define FUSES_FCCFG32_PFM_SZ(value)           (FUSES_FCCFG32_PFM_SZ_Msk & (_UINT32_(value) << FUSES_FCCFG32_PFM_SZ_Pos)) /* Assignment of value for PFM_SZ in the FUSES_FCCFG32 register */
#define   FUSES_FCCFG32_PFM_SZ_6_Val          _UINT32_(0x6)                                        /* (FUSES_FCCFG32) 512KB  */
#define FUSES_FCCFG32_PFM_SZ_6                (FUSES_FCCFG32_PFM_SZ_6_Val << FUSES_FCCFG32_PFM_SZ_Pos) /* (FUSES_FCCFG32) 512KB Position */
#define FUSES_FCCFG32_DRM_SZ_Pos              _UINT32_(8)                                          /* (FUSES_FCCFG32) Data Ram Memory (DRM) Size on Device Position */
#define FUSES_FCCFG32_DRM_SZ_Msk              (_UINT32_(0xFF) << FUSES_FCCFG32_DRM_SZ_Pos)         /* (FUSES_FCCFG32) Data Ram Memory (DRM) Size on Device Mask */
#define FUSES_FCCFG32_DRM_SZ(value)           (FUSES_FCCFG32_DRM_SZ_Msk & (_UINT32_(value) << FUSES_FCCFG32_DRM_SZ_Pos)) /* Assignment of value for DRM_SZ in the FUSES_FCCFG32 register */
#define   FUSES_FCCFG32_DRM_SZ_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG32) Rsvd  */
#define   FUSES_FCCFG32_DRM_SZ_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG32) 128KB  */
#define FUSES_FCCFG32_DRM_SZ_0                (FUSES_FCCFG32_DRM_SZ_0_Val << FUSES_FCCFG32_DRM_SZ_Pos) /* (FUSES_FCCFG32) Rsvd Position */
#define FUSES_FCCFG32_DRM_SZ_1                (FUSES_FCCFG32_DRM_SZ_1_Val << FUSES_FCCFG32_DRM_SZ_Pos) /* (FUSES_FCCFG32) 128KB Position */
#define FUSES_FCCFG32_FPACKAGE_Pos            _UINT32_(16)                                         /* (FUSES_FCCFG32) Number of Pins present on the Package Position */
#define FUSES_FCCFG32_FPACKAGE_Msk            (_UINT32_(0xF) << FUSES_FCCFG32_FPACKAGE_Pos)        /* (FUSES_FCCFG32) Number of Pins present on the Package Mask */
#define FUSES_FCCFG32_FPACKAGE(value)         (FUSES_FCCFG32_FPACKAGE_Msk & (_UINT32_(value) << FUSES_FCCFG32_FPACKAGE_Pos)) /* Assignment of value for FPACKAGE in the FUSES_FCCFG32 register */
#define   FUSES_FCCFG32_FPACKAGE_5_Val        _UINT32_(0x5)                                        /* (FUSES_FCCFG32) 48 pins  */
#define   FUSES_FCCFG32_FPACKAGE_6_Val        _UINT32_(0x6)                                        /* (FUSES_FCCFG32) 64 pins  */
#define   FUSES_FCCFG32_FPACKAGE_7_Val        _UINT32_(0x7)                                        /* (FUSES_FCCFG32) Rsvd  */
#define   FUSES_FCCFG32_FPACKAGE_8_Val        _UINT32_(0x8)                                        /* (FUSES_FCCFG32) 100 pins  */
#define FUSES_FCCFG32_FPACKAGE_5              (FUSES_FCCFG32_FPACKAGE_5_Val << FUSES_FCCFG32_FPACKAGE_Pos) /* (FUSES_FCCFG32) 48 pins Position */
#define FUSES_FCCFG32_FPACKAGE_6              (FUSES_FCCFG32_FPACKAGE_6_Val << FUSES_FCCFG32_FPACKAGE_Pos) /* (FUSES_FCCFG32) 64 pins Position */
#define FUSES_FCCFG32_FPACKAGE_7              (FUSES_FCCFG32_FPACKAGE_7_Val << FUSES_FCCFG32_FPACKAGE_Pos) /* (FUSES_FCCFG32) Rsvd Position */
#define FUSES_FCCFG32_FPACKAGE_8              (FUSES_FCCFG32_FPACKAGE_8_Val << FUSES_FCCFG32_FPACKAGE_Pos) /* (FUSES_FCCFG32) 100 pins Position */
#define FUSES_FCCFG32_DEVSEL_Pos              _UINT32_(24)                                         /* (FUSES_FCCFG32) Device Variant Configuration Position */
#define FUSES_FCCFG32_DEVSEL_Msk              (_UINT32_(0xFF) << FUSES_FCCFG32_DEVSEL_Pos)         /* (FUSES_FCCFG32) Device Variant Configuration Mask */
#define FUSES_FCCFG32_DEVSEL(value)           (FUSES_FCCFG32_DEVSEL_Msk & (_UINT32_(value) << FUSES_FCCFG32_DEVSEL_Pos)) /* Assignment of value for DEVSEL in the FUSES_FCCFG32 register */
#define FUSES_FCCFG32_Msk                     _UINT32_(0xFF0FFF0F)                                 /* (FUSES_FCCFG32) Register Mask  */


