Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
#define FUSES_FCCFG33_ME_TCC_Pos              _UINT32_(8)                                          /* (FUSES_FCCFG33 Position) Module enables for Variant configuration */
#define FUSES_FCCFG33_ME_TCC_Msk              (_UINT32_(0x7F) << FUSES_FCCFG33_ME_TCC_Pos)         /* (FUSES_FCCFG33 Mask) ME_TCC */
#define FUSES_FCCFG33_ME_TCC(value)           (FUSES_FCCFG33_ME_TCC_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_TCC_Pos)) 
#define FUSES_FCCFG33_ME_SERCOM_Pos           _UINT32_(18)                                         /* (FUSES_FCCFG33 Position) Module enables for Variant configuration */
#define FUSES_FCCFG33_ME_SERCOM_Msk           (_UINT32_(0x3F) << FUSES_FCCFG33_ME_SERCOM_Pos)      /* (FUSES_FCCFG33 Mask) ME_SERCOM */
#define FUSES_FCCFG33_ME_SERCOM(value)        (FUSES_FCCFG33_ME_SERCOM_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_SERCOM_Pos)) 

/* -------- FUSES_FCCFG34 : (FUSES Offset: 0x108) ( R/ 32) DSU Device Configuration 2 Register -------- */
#define FUSES_FCCFG34_ME_CAN0_Pos             _UINT32_(0)                                          /* (FUSES_FCCFG34) Module enables for Variant configuration Position */
#define FUSES_FCCFG34_ME_CAN0_Msk             (_UINT32_(0x1) << FUSES_FCCFG34_ME_CAN0_Pos)         /* (FUSES_FCCFG34) Module enables for Variant configuration Mask */
#define FUSES_FCCFG34_ME_CAN0(value)          (FUSES_FCCFG34_ME_CAN0_Msk & (_UINT32_(value) << FUSES_FCCFG34_ME_CAN0_Pos)) /* Assignment of value for ME_CAN0 in the FUSES_FCCFG34 register */
#define   FUSES_FCCFG34_ME_CAN0_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG34) Module is Disabled  */
#define   FUSES_FCCFG34_ME_CAN0_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG34) Module is Enabled  */
#define FUSES_FCCFG34_ME_CAN0_0               (FUSES_FCCFG34_ME_CAN0_0_Val << FUSES_FCCFG34_ME_CAN0_Pos) /* (FUSES_FCCFG34) Module is Disabled Position */
#define FUSES_FCCFG34_ME_CAN0_1               (FUSES_FCCFG34_ME_CAN0_1_Val << FUSES_FCCFG34_ME_CAN0_Pos) /* (FUSES_FCCFG34) Module is Enabled Position */
#define FUSES_FCCFG34_ME_CAN1_Pos             _UINT32_(1)                                          /* (FUSES_FCCFG34) Module enables for Variant configuration Position */
#define FUSES_FCCFG34_ME_CAN1_Msk             (_UINT32_(0x1) << FUSES_FCCFG34_ME_CAN1_Pos)         /* (FUSES_FCCFG34) Module enables for Variant configuration Mask */
#define FUSES_FCCFG34_ME_CAN1(value)          (FUSES_FCCFG34_ME_CAN1_Msk & (_UINT32_(value) << FUSES_FCCFG34_ME_CAN1_Pos)) /* Assignment of value for ME_CAN1 in the FUSES_FCCFG34 register */
#define   FUSES_FCCFG34_ME_CAN1_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG34) Module is Disabled  */
#define   FUSES_FCCFG34_ME_CAN1_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG34) Module is Enabled  */
#define FUSES_FCCFG34_ME_CAN1_0               (FUSES_FCCFG34_ME_CAN1_0_Val << FUSES_FCCFG34_ME_CAN1_Pos) /* (FUSES_FCCFG34) Module is Disabled Position */
#define FUSES_FCCFG34_ME_CAN1_1               (FUSES_FCCFG34_ME_CAN1_1_Val << FUSES_FCCFG34_ME_CAN1_Pos) /* (FUSES_FCCFG34) Module is Enabled Position */
#define FUSES_FCCFG34_ME_USBFS_Pos            _UINT32_(9)                                          /* (FUSES_FCCFG34) Module enables for Variant configuration Position */
#define FUSES_FCCFG34_ME_USBFS_Msk            (_UINT32_(0x1) << FUSES_FCCFG34_ME_USBFS_Pos)        /* (FUSES_FCCFG34) Module enables for Variant configuration Mask */
#define FUSES_FCCFG34_ME_USBFS(value)         (FUSES_FCCFG34_ME_USBFS_Msk & (_UINT32_(value) << FUSES_FCCFG34_ME_USBFS_Pos)) /* Assignment of value for ME_USBFS in the FUSES_FCCFG34 register */
#define   FUSES_FCCFG34_ME_USBFS_0_Val        _UINT32_(0x0)                                        /* (FUSES_FCCFG34) Module is Disabled  */
#define   FUSES_FCCFG34_ME_USBFS_1_Val        _UINT32_(0x1)                                        /* (FUSES_FCCFG34) Module is Enabled  */
#define FUSES_FCCFG34_ME_USBFS_0              (FUSES_FCCFG34_ME_USBFS_0_Val << FUSES_FCCFG34_ME_USBFS_Pos) /* (FUSES_FCCFG34) Module is Disabled Position */
#define FUSES_FCCFG34_ME_USBFS_1              (FUSES_FCCFG34_ME_USBFS_1_Val << FUSES_FCCFG34_ME_USBFS_Pos) /* (FUSES_FCCFG34) Module is Enabled Position */
#define FUSES_FCCFG34_ME_DPA_Pos              _UINT32_(23)                                         /* (FUSES_FCCFG34) Module enables for Variant configuration Position */
#define FUSES_FCCFG34_ME_DPA_Msk              (_UINT32_(0x1) << FUSES_FCCFG34_ME_DPA_Pos)          /* (FUSES_FCCFG34) Module enables for Variant configuration Mask */
#define FUSES_FCCFG34_ME_DPA(value)           (FUSES_FCCFG34_ME_DPA_Msk & (_UINT32_(value) << FUSES_FCCFG34_ME_DPA_Pos)) /* Assignment of value for ME_DPA in the FUSES_FCCFG34 register */
#define   FUSES_FCCFG34_ME_DPA_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG34) DPA is Disabled  */
#define   FUSES_FCCFG34_ME_DPA_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG34) DPA functions in HSM is Operational  */
#define FUSES_FCCFG34_ME_DPA_0                (FUSES_FCCFG34_ME_DPA_0_Val << FUSES_FCCFG34_ME_DPA_Pos) /* (FUSES_FCCFG34) DPA is Disabled Position */
#define FUSES_FCCFG34_ME_DPA_1                (FUSES_FCCFG34_ME_DPA_1_Val << FUSES_FCCFG34_ME_DPA_Pos) /* (FUSES_FCCFG34) DPA functions in HSM is Operational Position */
#define FUSES_FCCFG34_ME_TRAM_Pos             _UINT32_(30)                                         /* (FUSES_FCCFG34) Module enables for Variant configuration Position */
#define FUSES_FCCFG34_ME_TRAM_Msk             (_UINT32_(0x1) << FUSES_FCCFG34_ME_TRAM_Pos)         /* (FUSES_FCCFG34) Module enables for Variant configuration Mask */
#define FUSES_FCCFG34_ME_TRAM(value)          (FUSES_FCCFG34_ME_TRAM_Msk & (_UINT32_(value) << FUSES_FCCFG34_ME_TRAM_Pos)) /* Assignment of value for ME_TRAM in the FUSES_FCCFG34 register */
#define   FUSES_FCCFG34_ME_TRAM_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG34) Module is Disabled  */
#define   FUSES_FCCFG34_ME_TRAM_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG34) Module is Enabled  */
#define FUSES_FCCFG34_ME_TRAM_0               (FUSES_FCCFG34_ME_TRAM_0_Val << FUSES_FCCFG34_ME_TRAM_Pos) /* (FUSES_FCCFG34) Module is Disabled Position */
#define FUSES_FCCFG34_ME_TRAM_1               (FUSES_FCCFG34_ME_TRAM_1_Val << FUSES_FCCFG34_ME_TRAM_Pos) /* (FUSES_FCCFG34) Module is Enabled Position */
#define FUSES_FCCFG34_ME_PUF_Pos              _UINT32_(31)                                         /* (FUSES_FCCFG34) Module enables for Variant configuration Position */
#define FUSES_FCCFG34_ME_PUF_Msk              (_UINT32_(0x1) << FUSES_FCCFG34_ME_PUF_Pos)          /* (FUSES_FCCFG34) Module enables for Variant configuration Mask */
#define FUSES_FCCFG34_ME_PUF(value)           (FUSES_FCCFG34_ME_PUF_Msk & (_UINT32_(value) << FUSES_FCCFG34_ME_PUF_Pos)) /* Assignment of value for ME_PUF in the FUSES_FCCFG34 register */
#define   FUSES_FCCFG34_ME_PUF_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG34) Module is Disabled  */
#define   FUSES_FCCFG34_ME_PUF_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG34) Module is Enabled  */
#define FUSES_FCCFG34_ME_PUF_0                (FUSES_FCCFG34_ME_PUF_0_Val << FUSES_FCCFG34_ME_PUF_Pos) /* (FUSES_FCCFG34) Module is Disabled Position */
#define FUSES_FCCFG34_ME_PUF_1                (FUSES_FCCFG34_ME_PUF_1_Val << FUSES_FCCFG34_ME_PUF_Pos) /* (FUSES_FCCFG34) Module is Enabled Position */
#define FUSES_FCCFG34_Msk                     _UINT32_(0xC0800203)                                 /* (FUSES_FCCFG34) Register Mask  */

#define FUSES_FCCFG34_ME_CAN_Pos              _UINT32_(0)                                          /* (FUSES_FCCFG34 Position) Module enables for Variant configuration */
#define FUSES_FCCFG34_ME_CAN_Msk              (_UINT32_(0x3) << FUSES_FCCFG34_ME_CAN_Pos)          /* (FUSES_FCCFG34 Mask) ME_CAN */
#define FUSES_FCCFG34_ME_CAN(value)           (FUSES_FCCFG34_ME_CAN_Msk & (_UINT32_(value) << FUSES_FCCFG34_ME_CAN_Pos)) 

