Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
/* -------- FUSES_FCCFG49 : (FUSES Offset: 0x144) ( R/ 32) Calibration Configuration 49 Register -------- */
#define FUSES_FCCFG49_RAMC_EMAW_Pos           _UINT32_(0)                                          /* (FUSES_FCCFG49) Write Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_RAMC_EMAW_Msk           (_UINT32_(0x3) << FUSES_FCCFG49_RAMC_EMAW_Pos)       /* (FUSES_FCCFG49) Write Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_RAMC_EMAW(value)        (FUSES_FCCFG49_RAMC_EMAW_Msk & (_UINT32_(value) << FUSES_FCCFG49_RAMC_EMAW_Pos)) /* Assignment of value for RAMC_EMAW in the FUSES_FCCFG49 register */
#define   FUSES_FCCFG49_RAMC_EMAW_0_Val       _UINT32_(0x0)                                        /* (FUSES_FCCFG49) Slowest Access  */
#define   FUSES_FCCFG49_RAMC_EMAW_1_Val       _UINT32_(0x1)                                        /* (FUSES_FCCFG49)   */
#define   FUSES_FCCFG49_RAMC_EMAW_2_Val       _UINT32_(0x2)                                        /* (FUSES_FCCFG49)   */
#define   FUSES_FCCFG49_RAMC_EMAW_3_Val       _UINT32_(0x3)                                        /* (FUSES_FCCFG49) Fastest Access; Default (reset)  */
#define FUSES_FCCFG49_RAMC_EMAW_0             (FUSES_FCCFG49_RAMC_EMAW_0_Val << FUSES_FCCFG49_RAMC_EMAW_Pos) /* (FUSES_FCCFG49) Slowest Access Position */
#define FUSES_FCCFG49_RAMC_EMAW_1             (FUSES_FCCFG49_RAMC_EMAW_1_Val << FUSES_FCCFG49_RAMC_EMAW_Pos) /* (FUSES_FCCFG49)  Position */
#define FUSES_FCCFG49_RAMC_EMAW_2             (FUSES_FCCFG49_RAMC_EMAW_2_Val << FUSES_FCCFG49_RAMC_EMAW_Pos) /* (FUSES_FCCFG49)  Position */
#define FUSES_FCCFG49_RAMC_EMAW_3             (FUSES_FCCFG49_RAMC_EMAW_3_Val << FUSES_FCCFG49_RAMC_EMAW_Pos) /* (FUSES_FCCFG49) Fastest Access; Default (reset) Position */
#define FUSES_FCCFG49_RAMC_EMA_Pos            _UINT32_(2)                                          /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_RAMC_EMA_Msk            (_UINT32_(0x7) << FUSES_FCCFG49_RAMC_EMA_Pos)        /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_RAMC_EMA(value)         (FUSES_FCCFG49_RAMC_EMA_Msk & (_UINT32_(value) << FUSES_FCCFG49_RAMC_EMA_Pos)) /* Assignment of value for RAMC_EMA in the FUSES_FCCFG49 register */
#define   FUSES_FCCFG49_RAMC_EMA_0_Val        _UINT32_(0x0)                                        /* (FUSES_FCCFG49)   */
#define   FUSES_FCCFG49_RAMC_EMA_1_Val        _UINT32_(0x1)                                        /* (FUSES_FCCFG49)   */
#define   FUSES_FCCFG49_RAMC_EMA_2_Val        _UINT32_(0x2)                                        /* (FUSES_FCCFG49) Slowest Access  */
#define   FUSES_FCCFG49_RAMC_EMA_3_Val        _UINT32_(0x3)                                        /* (FUSES_FCCFG49)   */
#define   FUSES_FCCFG49_RAMC_EMA_4_Val        _UINT32_(0x4)                                        /* (FUSES_FCCFG49)   */
#define   FUSES_FCCFG49_RAMC_EMA_5_Val        _UINT32_(0x5)                                        /* (FUSES_FCCFG49) Fastest Access  */
#define   FUSES_FCCFG49_RAMC_EMA_6_Val        _UINT32_(0x6)                                        /* (FUSES_FCCFG49)   */
#define   FUSES_FCCFG49_RAMC_EMA_7_Val        _UINT32_(0x7)                                        /* (FUSES_FCCFG49) Default (reset)  */
#define FUSES_FCCFG49_RAMC_EMA_0              (FUSES_FCCFG49_RAMC_EMA_0_Val << FUSES_FCCFG49_RAMC_EMA_Pos) /* (FUSES_FCCFG49)  Position */
#define FUSES_FCCFG49_RAMC_EMA_1              (FUSES_FCCFG49_RAMC_EMA_1_Val << FUSES_FCCFG49_RAMC_EMA_Pos) /* (FUSES_FCCFG49)  Position */
#define FUSES_FCCFG49_RAMC_EMA_2              (FUSES_FCCFG49_RAMC_EMA_2_Val << FUSES_FCCFG49_RAMC_EMA_Pos) /* (FUSES_FCCFG49) Slowest Access Position */
#define FUSES_FCCFG49_RAMC_EMA_3              (FUSES_FCCFG49_RAMC_EMA_3_Val << FUSES_FCCFG49_RAMC_EMA_Pos) /* (FUSES_FCCFG49)  Position */
#define FUSES_FCCFG49_RAMC_EMA_4              (FUSES_FCCFG49_RAMC_EMA_4_Val << FUSES_FCCFG49_RAMC_EMA_Pos) /* (FUSES_FCCFG49)  Position */
#define FUSES_FCCFG49_RAMC_EMA_5              (FUSES_FCCFG49_RAMC_EMA_5_Val << FUSES_FCCFG49_RAMC_EMA_Pos) /* (FUSES_FCCFG49) Fastest Access Position */
#define FUSES_FCCFG49_RAMC_EMA_6              (FUSES_FCCFG49_RAMC_EMA_6_Val << FUSES_FCCFG49_RAMC_EMA_Pos) /* (FUSES_FCCFG49)  Position */
#define FUSES_FCCFG49_RAMC_EMA_7              (FUSES_FCCFG49_RAMC_EMA_7_Val << FUSES_FCCFG49_RAMC_EMA_Pos) /* (FUSES_FCCFG49) Default (reset) Position */
#define FUSES_FCCFG49_RAMAB_EMAW_Pos          _UINT32_(6)                                          /* (FUSES_FCCFG49) Write Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_RAMAB_EMAW_Msk          (_UINT32_(0x3) << FUSES_FCCFG49_RAMAB_EMAW_Pos)      /* (FUSES_FCCFG49) Write Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_RAMAB_EMAW(value)       (FUSES_FCCFG49_RAMAB_EMAW_Msk & (_UINT32_(value) << FUSES_FCCFG49_RAMAB_EMAW_Pos)) /* Assignment of value for RAMAB_EMAW in the FUSES_FCCFG49 register */
#define FUSES_FCCFG49_RAMAB_EMA_Pos           _UINT32_(8)                                          /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_RAMAB_EMA_Msk           (_UINT32_(0x7) << FUSES_FCCFG49_RAMAB_EMA_Pos)       /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_RAMAB_EMA(value)        (FUSES_FCCFG49_RAMAB_EMA_Msk & (_UINT32_(value) << FUSES_FCCFG49_RAMAB_EMA_Pos)) /* Assignment of value for RAMAB_EMA in the FUSES_FCCFG49 register */
#define FUSES_FCCFG49_TRAM_EMAW_Pos           _UINT32_(12)                                         /* (FUSES_FCCFG49) Write Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_TRAM_EMAW_Msk           (_UINT32_(0x3) << FUSES_FCCFG49_TRAM_EMAW_Pos)       /* (FUSES_FCCFG49) Write Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_TRAM_EMAW(value)        (FUSES_FCCFG49_TRAM_EMAW_Msk & (_UINT32_(value) << FUSES_FCCFG49_TRAM_EMAW_Pos)) /* Assignment of value for TRAM_EMAW in the FUSES_FCCFG49 register */
#define FUSES_FCCFG49_TRAM_EMA_Pos            _UINT32_(14)                                         /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_TRAM_EMA_Msk            (_UINT32_(0x7) << FUSES_FCCFG49_TRAM_EMA_Pos)        /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_TRAM_EMA(value)         (FUSES_FCCFG49_TRAM_EMA_Msk & (_UINT32_(value) << FUSES_FCCFG49_TRAM_EMA_Pos)) /* Assignment of value for TRAM_EMA in the FUSES_FCCFG49 register */
#define FUSES_FCCFG49_TRAM_EMAS_Pos           _UINT32_(17)                                         /* (FUSES_FCCFG49) Sense Amp Extra Margin Adjust Position */
#define FUSES_FCCFG49_TRAM_EMAS_Msk           (_UINT32_(0x1) << FUSES_FCCFG49_TRAM_EMAS_Pos)       /* (FUSES_FCCFG49) Sense Amp Extra Margin Adjust Mask */
#define FUSES_FCCFG49_TRAM_EMAS(value)        (FUSES_FCCFG49_TRAM_EMAS_Msk & (_UINT32_(value) << FUSES_FCCFG49_TRAM_EMAS_Pos)) /* Assignment of value for TRAM_EMAS in the FUSES_FCCFG49 register */
#define   FUSES_FCCFG49_TRAM_EMAS_0_Val       _UINT32_(0x0)                                        /* (FUSES_FCCFG49) Sense Amp Pulse Not Extended  */
#define   FUSES_FCCFG49_TRAM_EMAS_1_Val       _UINT32_(0x1)                                        /* (FUSES_FCCFG49) Sense Amp Pulse Extended; Default (reset)  */
#define FUSES_FCCFG49_TRAM_EMAS_0             (FUSES_FCCFG49_TRAM_EMAS_0_Val << FUSES_FCCFG49_TRAM_EMAS_Pos) /* (FUSES_FCCFG49) Sense Amp Pulse Not Extended Position */
#define FUSES_FCCFG49_TRAM_EMAS_1             (FUSES_FCCFG49_TRAM_EMAS_1_Val << FUSES_FCCFG49_TRAM_EMAS_Pos) /* (FUSES_FCCFG49) Sense Amp Pulse Extended; Default (reset) Position */
#define FUSES_FCCFG49_BROM_EMA_Pos            _UINT32_(20)                                         /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_BROM_EMA_Msk            (_UINT32_(0x7) << FUSES_FCCFG49_BROM_EMA_Pos)        /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_BROM_EMA(value)         (FUSES_FCCFG49_BROM_EMA_Msk & (_UINT32_(value) << FUSES_FCCFG49_BROM_EMA_Pos)) /* Assignment of value for BROM_EMA in the FUSES_FCCFG49 register */
#define FUSES_FCCFG49_PUF_EMAW_Pos            _UINT32_(24)                                         /* (FUSES_FCCFG49) Write Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_PUF_EMAW_Msk            (_UINT32_(0x3) << FUSES_FCCFG49_PUF_EMAW_Pos)        /* (FUSES_FCCFG49) Write Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_PUF_EMAW(value)         (FUSES_FCCFG49_PUF_EMAW_Msk & (_UINT32_(value) << FUSES_FCCFG49_PUF_EMAW_Pos)) /* Assignment of value for PUF_EMAW in the FUSES_FCCFG49 register */
#define FUSES_FCCFG49_PUF_EMA_Pos             _UINT32_(26)                                         /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Position */
#define FUSES_FCCFG49_PUF_EMA_Msk             (_UINT32_(0x7) << FUSES_FCCFG49_PUF_EMA_Pos)         /* (FUSES_FCCFG49) Cycle and Read Time Extra Margin Adjust Mask */
#define FUSES_FCCFG49_PUF_EMA(value)          (FUSES_FCCFG49_PUF_EMA_Msk & (_UINT32_(value) << FUSES_FCCFG49_PUF_EMA_Pos)) /* Assignment of value for PUF_EMA in the FUSES_FCCFG49 register */
#define FUSES_FCCFG49_PUF_EMAS_Pos            _UINT32_(29)                                         /* (FUSES_FCCFG49) Sense Amp Extra Margin Adjust Position */
#define FUSES_FCCFG49_PUF_EMAS_Msk            (_UINT32_(0x1) << FUSES_FCCFG49_PUF_EMAS_Pos)        /* (FUSES_FCCFG49) Sense Amp Extra Margin Adjust Mask */
#define FUSES_FCCFG49_PUF_EMAS(value)         (FUSES_FCCFG49_PUF_EMAS_Msk & (_UINT32_(value) << FUSES_FCCFG49_PUF_EMAS_Pos)) /* Assignment of value for PUF_EMAS in the FUSES_FCCFG49 register */
#define   FUSES_FCCFG49_PUF_EMAS_0_Val        _UINT32_(0x0)                                        /* (FUSES_FCCFG49) Sense Amp Pulse Not Extended  */
#define   FUSES_FCCFG49_PUF_EMAS_1_Val        _UINT32_(0x1)                                        /* (FUSES_FCCFG49) Sense Amp Pulse Extended; Default (reset)  */
#define FUSES_FCCFG49_PUF_EMAS_0              (FUSES_FCCFG49_PUF_EMAS_0_Val << FUSES_FCCFG49_PUF_EMAS_Pos) /* (FUSES_FCCFG49) Sense Amp Pulse Not Extended Position */
#define FUSES_FCCFG49_PUF_EMAS_1              (FUSES_FCCFG49_PUF_EMAS_1_Val << FUSES_FCCFG49_PUF_EMAS_Pos) /* (FUSES_FCCFG49) Sense Amp Pulse Extended; Default (reset) Position */
#define FUSES_FCCFG49_Msk                     _UINT32_(0x3F73F7DF)                                 /* (FUSES_FCCFG49) Register Mask  */


/* -------- FUSES_FCCFG56 : (FUSES Offset: 0x160) ( R/ 32) Calibration Configuration 56 Register -------- */
#define FUSES_FCCFG56_BRINGOSC_Pos            _UINT32_(0)                                          /* (FUSES_FCCFG56) SUPC Ring-osc depth Position */
#define FUSES_FCCFG56_BRINGOSC_Msk            (_UINT32_(0x3) << FUSES_FCCFG56_BRINGOSC_Pos)        /* (FUSES_FCCFG56) SUPC Ring-osc depth Mask */
#define FUSES_FCCFG56_BRINGOSC(value)         (FUSES_FCCFG56_BRINGOSC_Msk & (_UINT32_(value) << FUSES_FCCFG56_BRINGOSC_Pos)) /* Assignment of value for BRINGOSC in the FUSES_FCCFG56 register */
#define   FUSES_FCCFG56_BRINGOSC_0_Val        _UINT32_(0x0)                                        /* (FUSES_FCCFG56) Ring oscillator depth is default (DLY0)  */
#define   FUSES_FCCFG56_BRINGOSC_1_Val        _UINT32_(0x1)                                        /* (FUSES_FCCFG56) Ring oscillator depth is default + 1 ORDLY15 (DLY1)  */
#define   FUSES_FCCFG56_BRINGOSC_2_Val        _UINT32_(0x2)                                        /* (FUSES_FCCFG56) Ring oscillator depth is default + 2 ORDLY15 (DLY2)  */
#define   FUSES_FCCFG56_BRINGOSC_3_Val        _UINT32_(0x3)                                        /* (FUSES_FCCFG56) Ring oscillator depth is default + 3 ORDLY15 (DLY3)  */
#define FUSES_FCCFG56_BRINGOSC_0              (FUSES_FCCFG56_BRINGOSC_0_Val << FUSES_FCCFG56_BRINGOSC_Pos) /* (FUSES_FCCFG56) Ring oscillator depth is default (DLY0) Position */
#define FUSES_FCCFG56_BRINGOSC_1              (FUSES_FCCFG56_BRINGOSC_1_Val << FUSES_FCCFG56_BRINGOSC_Pos) /* (FUSES_FCCFG56) Ring oscillator depth is default + 1 ORDLY15 (DLY1) Position */
#define FUSES_FCCFG56_BRINGOSC_2              (FUSES_FCCFG56_BRINGOSC_2_Val << FUSES_FCCFG56_BRINGOSC_Pos) /* (FUSES_FCCFG56) Ring oscillator depth is default + 2 ORDLY15 (DLY2) Position */
#define FUSES_FCCFG56_BRINGOSC_3              (FUSES_FCCFG56_BRINGOSC_3_Val << FUSES_FCCFG56_BRINGOSC_Pos) /* (FUSES_FCCFG56) Ring oscillator depth is default + 3 ORDLY15 (DLY3) Position */
#define FUSES_FCCFG56_DIS_BOR12_RAMON_Pos     _UINT32_(4)                                          /* (FUSES_FCCFG56) Disable BOR12 (VREGRAM comparator) when RAM are turned ON when leaving sleep mode Position */
#define FUSES_FCCFG56_DIS_BOR12_RAMON_Msk     (_UINT32_(0x1) << FUSES_FCCFG56_DIS_BOR12_RAMON_Pos) /* (FUSES_FCCFG56) Disable BOR12 (VREGRAM comparator) when RAM are turned ON when leaving sleep mode Mask */
#define FUSES_FCCFG56_DIS_BOR12_RAMON(value)  (FUSES_FCCFG56_DIS_BOR12_RAMON_Msk & (_UINT32_(value) << FUSES_FCCFG56_DIS_BOR12_RAMON_Pos)) /* Assignment of value for DIS_BOR12_RAMON in the FUSES_FCCFG56 register */
#define FUSES_FCCFG56_DIS_BOR12_VSCALING_Pos  _UINT32_(5)                                          /* (FUSES_FCCFG56) Disable BOR12 (VREGRAM comparator) when down voltage scaling is on going from 1.2v to 0.8v to workaround VREG undershoot issue Position */
#define FUSES_FCCFG56_DIS_BOR12_VSCALING_Msk  (_UINT32_(0x1) << FUSES_FCCFG56_DIS_BOR12_VSCALING_Pos) /* (FUSES_FCCFG56) Disable BOR12 (VREGRAM comparator) when down voltage scaling is on going from 1.2v to 0.8v to workaround VREG undershoot issue Mask */
#define FUSES_FCCFG56_DIS_BOR12_VSCALING(value) (FUSES_FCCFG56_DIS_BOR12_VSCALING_Msk & (_UINT32_(value) << FUSES_FCCFG56_DIS_BOR12_VSCALING_Pos)) /* Assignment of value for DIS_BOR12_VSCALING in the FUSES_FCCFG56 register */
#define FUSES_FCCFG56_VLP2FPST_Pos            _UINT32_(16)                                         /* (FUSES_FCCFG56) Vreg Low Power to Full Power Stabilization Time Position */
#define FUSES_FCCFG56_VLP2FPST_Msk            (_UINT32_(0x3) << FUSES_FCCFG56_VLP2FPST_Pos)        /* (FUSES_FCCFG56) Vreg Low Power to Full Power Stabilization Time Mask */
#define FUSES_FCCFG56_VLP2FPST(value)         (FUSES_FCCFG56_VLP2FPST_Msk & (_UINT32_(value) << FUSES_FCCFG56_VLP2FPST_Pos)) /* Assignment of value for VLP2FPST in the FUSES_FCCFG56 register */
#define   FUSES_FCCFG56_VLP2FPST_0_Val        _UINT32_(0x0)                                        /* (FUSES_FCCFG56) 5us -32 clock cycles based on 6Mhz clock (5US)  */
#define   FUSES_FCCFG56_VLP2FPST_1_Val        _UINT32_(0x1)                                        /* (FUSES_FCCFG56) 10us -64 clock cycles based on 6Mhz clock (10US)  */
#define   FUSES_FCCFG56_VLP2FPST_2_Val        _UINT32_(0x2)                                        /* (FUSES_FCCFG56) 21us -128 clock cycles based on 6Mhz clock (21US)  */
#define   FUSES_FCCFG56_VLP2FPST_3_Val        _UINT32_(0x3)                                        /* (FUSES_FCCFG56) 1.3us -8 clock cycles based on 6Mhz clock (1US)  */
#define FUSES_FCCFG56_VLP2FPST_0              (FUSES_FCCFG56_VLP2FPST_0_Val << FUSES_FCCFG56_VLP2FPST_Pos) /* (FUSES_FCCFG56) 5us -32 clock cycles based on 6Mhz clock (5US) Position */
#define FUSES_FCCFG56_VLP2FPST_1              (FUSES_FCCFG56_VLP2FPST_1_Val << FUSES_FCCFG56_VLP2FPST_Pos) /* (FUSES_FCCFG56) 10us -64 clock cycles based on 6Mhz clock (10US) Position */
#define FUSES_FCCFG56_VLP2FPST_2              (FUSES_FCCFG56_VLP2FPST_2_Val << FUSES_FCCFG56_VLP2FPST_Pos) /* (FUSES_FCCFG56) 21us -128 clock cycles based on 6Mhz clock (21US) Position */
#define FUSES_FCCFG56_VLP2FPST_3              (FUSES_FCCFG56_VLP2FPST_3_Val << FUSES_FCCFG56_VLP2FPST_Pos) /* (FUSES_FCCFG56) 1.3us -8 clock cycles based on 6Mhz clock (1US) Position */
#define FUSES_FCCFG56_VLPMST_Pos              _UINT32_(18)                                         /* (FUSES_FCCFG56) Vreg LP Mode Stabilization Time Position */
#define FUSES_FCCFG56_VLPMST_Msk              (_UINT32_(0x3) << FUSES_FCCFG56_VLPMST_Pos)          /* (FUSES_FCCFG56) Vreg LP Mode Stabilization Time Mask */
#define FUSES_FCCFG56_VLPMST(value)           (FUSES_FCCFG56_VLPMST_Msk & (_UINT32_(value) << FUSES_FCCFG56_VLPMST_Pos)) /* Assignment of value for VLPMST in the FUSES_FCCFG56 register */
#define   FUSES_FCCFG56_VLPMST_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG56) 1.3us -8 clock cycles based on 6Mhz clock (1US)  */
#define   FUSES_FCCFG56_VLPMST_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG56) 2.6us -16 clock cycles based on 6Mhz clock (2US)  */
#define   FUSES_FCCFG56_VLPMST_2_Val          _UINT32_(0x2)                                        /* (FUSES_FCCFG56) 5us -32 clock cycles based on 6Mhz clock (5US)  */
#define   FUSES_FCCFG56_VLPMST_3_Val          _UINT32_(0x3)                                        /* (FUSES_FCCFG56) 0.166us -1 clock cycles based on 6Mhz clock (0US)  */
#define FUSES_FCCFG56_VLPMST_0                (FUSES_FCCFG56_VLPMST_0_Val << FUSES_FCCFG56_VLPMST_Pos) /* (FUSES_FCCFG56) 1.3us -8 clock cycles based on 6Mhz clock (1US) Position */
#define FUSES_FCCFG56_VLPMST_1                (FUSES_FCCFG56_VLPMST_1_Val << FUSES_FCCFG56_VLPMST_Pos) /* (FUSES_FCCFG56) 2.6us -16 clock cycles based on 6Mhz clock (2US) Position */
#define FUSES_FCCFG56_VLPMST_2                (FUSES_FCCFG56_VLPMST_2_Val << FUSES_FCCFG56_VLPMST_Pos) /* (FUSES_FCCFG56) 5us -32 clock cycles based on 6Mhz clock (5US) Position */
#define FUSES_FCCFG56_VLPMST_3                (FUSES_FCCFG56_VLPMST_3_Val << FUSES_FCCFG56_VLPMST_Pos) /* (FUSES_FCCFG56) 0.166us -1 clock cycles based on 6Mhz clock (0US) Position */
#define FUSES_FCCFG56_VTONST_Pos              _UINT32_(20)                                         /* (FUSES_FCCFG56) Vreg Turned On Stabilization Time Position */
#define FUSES_FCCFG56_VTONST_Msk              (_UINT32_(0x3) << FUSES_FCCFG56_VTONST_Pos)          /* (FUSES_FCCFG56) Vreg Turned On Stabilization Time Mask */
#define FUSES_FCCFG56_VTONST(value)           (FUSES_FCCFG56_VTONST_Msk & (_UINT32_(value) << FUSES_FCCFG56_VTONST_Pos)) /* Assignment of value for VTONST in the FUSES_FCCFG56 register */
#define   FUSES_FCCFG56_VTONST_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG56) 31us -192 clock cycles based on 6Mhz clock (31US)  */
#define   FUSES_FCCFG56_VTONST_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG56) 42us -256 clock cycles based on 6Mhz clock (42US)  */
#define   FUSES_FCCFG56_VTONST_2_Val          _UINT32_(0x2)                                        /* (FUSES_FCCFG56) 84us -512 clock cycles based on 6Mhz clock (84US)  */
#define   FUSES_FCCFG56_VTONST_3_Val          _UINT32_(0x3)                                        /* (FUSES_FCCFG56) 10.6us -64 clock cycles based on 6Mhz clock (10US)  */
#define FUSES_FCCFG56_VTONST_0                (FUSES_FCCFG56_VTONST_0_Val << FUSES_FCCFG56_VTONST_Pos) /* (FUSES_FCCFG56) 31us -192 clock cycles based on 6Mhz clock (31US) Position */
#define FUSES_FCCFG56_VTONST_1                (FUSES_FCCFG56_VTONST_1_Val << FUSES_FCCFG56_VTONST_Pos) /* (FUSES_FCCFG56) 42us -256 clock cycles based on 6Mhz clock (42US) Position */
#define FUSES_FCCFG56_VTONST_2                (FUSES_FCCFG56_VTONST_2_Val << FUSES_FCCFG56_VTONST_Pos) /* (FUSES_FCCFG56) 84us -512 clock cycles based on 6Mhz clock (84US) Position */
#define FUSES_FCCFG56_VTONST_3                (FUSES_FCCFG56_VTONST_3_Val << FUSES_FCCFG56_VTONST_Pos) /* (FUSES_FCCFG56) 10.6us -64 clock cycles based on 6Mhz clock (10US) Position */
#define FUSES_FCCFG56_VPDDST_Pos              _UINT32_(22)                                         /* (FUSES_FCCFG56) Vreg Pull Down Disable Stabilization Time Position */
#define FUSES_FCCFG56_VPDDST_Msk              (_UINT32_(0x3) << FUSES_FCCFG56_VPDDST_Pos)          /* (FUSES_FCCFG56) Vreg Pull Down Disable Stabilization Time Mask */
#define FUSES_FCCFG56_VPDDST(value)           (FUSES_FCCFG56_VPDDST_Msk & (_UINT32_(value) << FUSES_FCCFG56_VPDDST_Pos)) /* Assignment of value for VPDDST in the FUSES_FCCFG56 register */
#define   FUSES_FCCFG56_VPDDST_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG56) 21us -128 clock cycles based on 6Mhz clock (21US)  */
#define   FUSES_FCCFG56_VPDDST_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG56) 42us -256 clock cycles based on 6Mhz clock (42US)  */
#define   FUSES_FCCFG56_VPDDST_2_Val          _UINT32_(0x2)                                        /* (FUSES_FCCFG56) 84us -512 clock cycles based on 6Mhz clock (84US)  */
#define   FUSES_FCCFG56_VPDDST_3_Val          _UINT32_(0x3)                                        /* (FUSES_FCCFG56) 10.6us -64 clock cycles based on 6Mhz clock (10US)  */
#define FUSES_FCCFG56_VPDDST_0                (FUSES_FCCFG56_VPDDST_0_Val << FUSES_FCCFG56_VPDDST_Pos) /* (FUSES_FCCFG56) 21us -128 clock cycles based on 6Mhz clock (21US) Position */
#define FUSES_FCCFG56_VPDDST_1                (FUSES_FCCFG56_VPDDST_1_Val << FUSES_FCCFG56_VPDDST_Pos) /* (FUSES_FCCFG56) 42us -256 clock cycles based on 6Mhz clock (42US) Position */
#define FUSES_FCCFG56_VPDDST_2                (FUSES_FCCFG56_VPDDST_2_Val << FUSES_FCCFG56_VPDDST_Pos) /* (FUSES_FCCFG56) 84us -512 clock cycles based on 6Mhz clock (84US) Position */
#define FUSES_FCCFG56_VPDDST_3                (FUSES_FCCFG56_VPDDST_3_Val << FUSES_FCCFG56_VPDDST_Pos) /* (FUSES_FCCFG56) 10.6us -64 clock cycles based on 6Mhz clock (10US) Position */
#define FUSES_FCCFG56_VDVSST_Pos              _UINT32_(24)                                         /* (FUSES_FCCFG56) Vreg Down Voltage Scaling Stabilization Time Position */
#define FUSES_FCCFG56_VDVSST_Msk              (_UINT32_(0x3) << FUSES_FCCFG56_VDVSST_Pos)          /* (FUSES_FCCFG56) Vreg Down Voltage Scaling Stabilization Time Mask */
#define FUSES_FCCFG56_VDVSST(value)           (FUSES_FCCFG56_VDVSST_Msk & (_UINT32_(value) << FUSES_FCCFG56_VDVSST_Pos)) /* Assignment of value for VDVSST in the FUSES_FCCFG56 register */
#define   FUSES_FCCFG56_VDVSST_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG56) 32us -192 clock cycles based on 6Mhz clock (32US)  */
#define   FUSES_FCCFG56_VDVSST_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG56) 42us -256 clock cycles based on 6Mhz clock (42US)  */
#define   FUSES_FCCFG56_VDVSST_2_Val          _UINT32_(0x2)                                        /* (FUSES_FCCFG56) 84us -512 clock cycles based on 6Mhz clock (84US)  */
#define   FUSES_FCCFG56_VDVSST_3_Val          _UINT32_(0x3)                                        /* (FUSES_FCCFG56) 10us -64 clock cycles based on 6Mhz clock (10US)  */
#define FUSES_FCCFG56_VDVSST_0                (FUSES_FCCFG56_VDVSST_0_Val << FUSES_FCCFG56_VDVSST_Pos) /* (FUSES_FCCFG56) 32us -192 clock cycles based on 6Mhz clock (32US) Position */
#define FUSES_FCCFG56_VDVSST_1                (FUSES_FCCFG56_VDVSST_1_Val << FUSES_FCCFG56_VDVSST_Pos) /* (FUSES_FCCFG56) 42us -256 clock cycles based on 6Mhz clock (42US) Position */
#define FUSES_FCCFG56_VDVSST_2                (FUSES_FCCFG56_VDVSST_2_Val << FUSES_FCCFG56_VDVSST_Pos) /* (FUSES_FCCFG56) 84us -512 clock cycles based on 6Mhz clock (84US) Position */
#define FUSES_FCCFG56_VDVSST_3                (FUSES_FCCFG56_VDVSST_3_Val << FUSES_FCCFG56_VDVSST_Pos) /* (FUSES_FCCFG56) 10us -64 clock cycles based on 6Mhz clock (10US) Position */
#define FUSES_FCCFG56_Msk                     _UINT32_(0x03FF0033)                                 /* (FUSES_FCCFG56) Register Mask  */


