Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/fuses.h
#define FUSES_PUF_AC128_REG_OFST       _UINT32_(0xE00)     /* (FUSES_PUF_AC128) Mapped Fuse Register Offset */
#define FUSES_PUF_AC129_REG_OFST       _UINT32_(0xE04)     /* (FUSES_PUF_AC129) Mapped Fuse Register Offset */
#define FUSES_PUF_AC130_REG_OFST       _UINT32_(0xE08)     /* (FUSES_PUF_AC130) Mapped Fuse Register Offset */
#define FUSES_PUF_AC131_REG_OFST       _UINT32_(0xE0C)     /* (FUSES_PUF_AC131) Mapped Fuse Register Offset */
#define FUSES_PUF_AC132_REG_OFST       _UINT32_(0xE10)     /* (FUSES_PUF_AC132) Mapped Fuse Register Offset */
#define FUSES_PUF_AC133_REG_OFST       _UINT32_(0xE14)     /* (FUSES_PUF_AC133) Mapped Fuse Register Offset */
#define FUSES_PUF_AC134_REG_OFST       _UINT32_(0xE18)     /* (FUSES_PUF_AC134) Mapped Fuse Register Offset */
#define FUSES_PUF_AC135_REG_OFST       _UINT32_(0xE1C)     /* (FUSES_PUF_AC135) Mapped Fuse Register Offset */
#define FUSES_PUF_AC136_REG_OFST       _UINT32_(0xE20)     /* (FUSES_PUF_AC136) Mapped Fuse Register Offset */
#define FUSES_PUF_AC137_REG_OFST       _UINT32_(0xE24)     /* (FUSES_PUF_AC137) Mapped Fuse Register Offset */
#define FUSES_PUF_AC138_REG_OFST       _UINT32_(0xE28)     /* (FUSES_PUF_AC138) Mapped Fuse Register Offset */
#define FUSES_PUF_AC139_REG_OFST       _UINT32_(0xE2C)     /* (FUSES_PUF_AC139) Mapped Fuse Register Offset */
#define FUSES_PUF_AC140_REG_OFST       _UINT32_(0xE30)     /* (FUSES_PUF_AC140) Mapped Fuse Register Offset */
#define FUSES_PUF_AC141_REG_OFST       _UINT32_(0xE34)     /* (FUSES_PUF_AC141) Mapped Fuse Register Offset */
#define FUSES_PUF_AC142_REG_OFST       _UINT32_(0xE38)     /* (FUSES_PUF_AC142) Mapped Fuse Register Offset */
#define FUSES_PUF_AC143_REG_OFST       _UINT32_(0xE3C)     /* (FUSES_PUF_AC143) Mapped Fuse Register Offset */
#define FUSES_PUF_AC144_REG_OFST       _UINT32_(0xE40)     /* (FUSES_PUF_AC144) Mapped Fuse Register Offset */
#define FUSES_PUF_AC145_REG_OFST       _UINT32_(0xE44)     /* (FUSES_PUF_AC145) Mapped Fuse Register Offset */
#define FUSES_PUF_AC146_REG_OFST       _UINT32_(0xE48)     /* (FUSES_PUF_AC146) Mapped Fuse Register Offset */
#define FUSES_PUF_AC147_REG_OFST       _UINT32_(0xE4C)     /* (FUSES_PUF_AC147) Mapped Fuse Register Offset */
#define FUSES_PUF_AC148_REG_OFST       _UINT32_(0xE50)     /* (FUSES_PUF_AC148) Mapped Fuse Register Offset */
#define FUSES_PUF_AC149_REG_OFST       _UINT32_(0xE54)     /* (FUSES_PUF_AC149) Mapped Fuse Register Offset */
#define FUSES_PUF_AC150_REG_OFST       _UINT32_(0xE58)     /* (FUSES_PUF_AC150) Mapped Fuse Register Offset */
#define FUSES_PUF_AC151_REG_OFST       _UINT32_(0xE5C)     /* (FUSES_PUF_AC151) Mapped Fuse Register Offset */
#define FUSES_PUF_AC152_REG_OFST       _UINT32_(0xE60)     /* (FUSES_PUF_AC152) Mapped Fuse Register Offset */
#define FUSES_PUF_AC153_REG_OFST       _UINT32_(0xE64)     /* (FUSES_PUF_AC153) Mapped Fuse Register Offset */
#define FUSES_PUF_AC154_REG_OFST       _UINT32_(0xE68)     /* (FUSES_PUF_AC154) Mapped Fuse Register Offset */
#define FUSES_PUF_AC155_REG_OFST       _UINT32_(0xE6C)     /* (FUSES_PUF_AC155) Mapped Fuse Register Offset */
#define FUSES_PUF_AC156_REG_OFST       _UINT32_(0xE70)     /* (FUSES_PUF_AC156) Mapped Fuse Register Offset */
#define FUSES_PUF_AC157_REG_OFST       _UINT32_(0xE74)     /* (FUSES_PUF_AC157) Mapped Fuse Register Offset */
#define FUSES_PUF_AC158_REG_OFST       _UINT32_(0xE78)     /* (FUSES_PUF_AC158) Mapped Fuse Register Offset */
#define FUSES_PUF_AC159_REG_OFST       _UINT32_(0xE7C)     /* (FUSES_PUF_AC159) Mapped Fuse Register Offset */
#define FUSES_PUF_AC160_REG_OFST       _UINT32_(0xE80)     /* (FUSES_PUF_AC160) Mapped Fuse Register Offset */
#define FUSES_PUF_AC161_REG_OFST       _UINT32_(0xE84)     /* (FUSES_PUF_AC161) Mapped Fuse Register Offset */
#define FUSES_PUF_AC162_REG_OFST       _UINT32_(0xE88)     /* (FUSES_PUF_AC162) Mapped Fuse Register Offset */
#define FUSES_PUF_AC163_REG_OFST       _UINT32_(0xE8C)     /* (FUSES_PUF_AC163) Mapped Fuse Register Offset */
#define FUSES_PUF_AC164_REG_OFST       _UINT32_(0xE90)     /* (FUSES_PUF_AC164) Mapped Fuse Register Offset */
#define FUSES_PUF_AC165_REG_OFST       _UINT32_(0xE94)     /* (FUSES_PUF_AC165) Mapped Fuse Register Offset */
#define FUSES_PUF_AC166_REG_OFST       _UINT32_(0xE98)     /* (FUSES_PUF_AC166) Mapped Fuse Register Offset */
#define FUSES_PUF_AC167_REG_OFST       _UINT32_(0xE9C)     /* (FUSES_PUF_AC167) Mapped Fuse Register Offset */
#define FUSES_PUF_AC168_REG_OFST       _UINT32_(0xEA0)     /* (FUSES_PUF_AC168) Mapped Fuse Register Offset */
#define FUSES_PUF_AC169_REG_OFST       _UINT32_(0xEA4)     /* (FUSES_PUF_AC169) Mapped Fuse Register Offset */
#define FUSES_PUF_AC170_REG_OFST       _UINT32_(0xEA8)     /* (FUSES_PUF_AC170) Mapped Fuse Register Offset */
#define FUSES_PUF_AC171_REG_OFST       _UINT32_(0xEAC)     /* (FUSES_PUF_AC171) Mapped Fuse Register Offset */
#define FUSES_PUF_AC172_REG_OFST       _UINT32_(0xEB0)     /* (FUSES_PUF_AC172) Mapped Fuse Register Offset */
#define FUSES_PUF_AC173_REG_OFST       _UINT32_(0xEB4)     /* (FUSES_PUF_AC173) Mapped Fuse Register Offset */
#define FUSES_PUF_AC174_REG_OFST       _UINT32_(0xEB8)     /* (FUSES_PUF_AC174) Mapped Fuse Register Offset */
#define FUSES_PUF_AC175_REG_OFST       _UINT32_(0xEBC)     /* (FUSES_PUF_AC175) Mapped Fuse Register Offset */
#define FUSES_PUF_AC176_REG_OFST       _UINT32_(0xEC0)     /* (FUSES_PUF_AC176) Mapped Fuse Register Offset */
#define FUSES_PUF_AC177_REG_OFST       _UINT32_(0xEC4)     /* (FUSES_PUF_AC177) Mapped Fuse Register Offset */
#define FUSES_PUF_AC178_REG_OFST       _UINT32_(0xEC8)     /* (FUSES_PUF_AC178) Mapped Fuse Register Offset */
#define FUSES_PUF_AC179_REG_OFST       _UINT32_(0xECC)     /* (FUSES_PUF_AC179) Mapped Fuse Register Offset */
#define FUSES_PUF_AC180_REG_OFST       _UINT32_(0xED0)     /* (FUSES_PUF_AC180) Mapped Fuse Register Offset */
#define FUSES_PUF_AC181_REG_OFST       _UINT32_(0xED4)     /* (FUSES_PUF_AC181) Mapped Fuse Register Offset */
#define FUSES_PUF_AC182_REG_OFST       _UINT32_(0xED8)     /* (FUSES_PUF_AC182) Mapped Fuse Register Offset */
#define FUSES_PUF_AC183_REG_OFST       _UINT32_(0xEDC)     /* (FUSES_PUF_AC183) Mapped Fuse Register Offset */
#define FUSES_PUF_AC184_REG_OFST       _UINT32_(0xEE0)     /* (FUSES_PUF_AC184) Mapped Fuse Register Offset */
#define FUSES_PUF_AC185_REG_OFST       _UINT32_(0xEE4)     /* (FUSES_PUF_AC185) Mapped Fuse Register Offset */
#define FUSES_PUF_AC186_REG_OFST       _UINT32_(0xEE8)     /* (FUSES_PUF_AC186) Mapped Fuse Register Offset */
#define FUSES_PUF_AC187_REG_OFST       _UINT32_(0xEEC)     /* (FUSES_PUF_AC187) Mapped Fuse Register Offset */
#define FUSES_PUF_AC188_REG_OFST       _UINT32_(0xEF0)     /* (FUSES_PUF_AC188) Mapped Fuse Register Offset */
#define FUSES_PUF_AC189_REG_OFST       _UINT32_(0xEF4)     /* (FUSES_PUF_AC189) Mapped Fuse Register Offset */
#define FUSES_PUF_AC190_REG_OFST       _UINT32_(0xEF8)     /* (FUSES_PUF_AC190) Mapped Fuse Register Offset */
#define FUSES_PUF_AC191_REG_OFST       _UINT32_(0xEFC)     /* (FUSES_PUF_AC191) Mapped Fuse Register Offset */
#define FUSES_PUF_AC192_REG_OFST       _UINT32_(0xF00)     /* (FUSES_PUF_AC192) Mapped Fuse Register Offset */
#define FUSES_PUF_AC193_REG_OFST       _UINT32_(0xF04)     /* (FUSES_PUF_AC193) Mapped Fuse Register Offset */
#define FUSES_PUF_AC194_REG_OFST       _UINT32_(0xF08)     /* (FUSES_PUF_AC194) Mapped Fuse Register Offset */
#define FUSES_PUF_AC195_REG_OFST       _UINT32_(0xF0C)     /* (FUSES_PUF_AC195) Mapped Fuse Register Offset */
#define FUSES_PUF_AC196_REG_OFST       _UINT32_(0xF10)     /* (FUSES_PUF_AC196) Mapped Fuse Register Offset */
#define FUSES_PUF_AC197_REG_OFST       _UINT32_(0xF14)     /* (FUSES_PUF_AC197) Mapped Fuse Register Offset */
#define FUSES_PUF_AC198_REG_OFST       _UINT32_(0xF18)     /* (FUSES_PUF_AC198) Mapped Fuse Register Offset */
#define FUSES_PUF_AC199_REG_OFST       _UINT32_(0xF1C)     /* (FUSES_PUF_AC199) Mapped Fuse Register Offset */
#define FUSES_PUF_AC200_REG_OFST       _UINT32_(0xF20)     /* (FUSES_PUF_AC200) Mapped Fuse Register Offset */
#define FUSES_PUF_AC201_REG_OFST       _UINT32_(0xF24)     /* (FUSES_PUF_AC201) Mapped Fuse Register Offset */
#define FUSES_PUF_AC202_REG_OFST       _UINT32_(0xF28)     /* (FUSES_PUF_AC202) Mapped Fuse Register Offset */
#define FUSES_PUF_AC203_REG_OFST       _UINT32_(0xF2C)     /* (FUSES_PUF_AC203) Mapped Fuse Register Offset */
#define FUSES_PUF_AC204_REG_OFST       _UINT32_(0xF30)     /* (FUSES_PUF_AC204) Mapped Fuse Register Offset */
#define FUSES_PUF_AC205_REG_OFST       _UINT32_(0xF34)     /* (FUSES_PUF_AC205) Mapped Fuse Register Offset */
#define FUSES_PUF_AC206_REG_OFST       _UINT32_(0xF38)     /* (FUSES_PUF_AC206) Mapped Fuse Register Offset */
#define FUSES_PUF_AC207_REG_OFST       _UINT32_(0xF3C)     /* (FUSES_PUF_AC207) Mapped Fuse Register Offset */
#define FUSES_PUF_AC208_REG_OFST       _UINT32_(0xF40)     /* (FUSES_PUF_AC208) Mapped Fuse Register Offset */
#define FUSES_PUF_AC209_REG_OFST       _UINT32_(0xF44)     /* (FUSES_PUF_AC209) Mapped Fuse Register Offset */
#define FUSES_PUF_AC210_REG_OFST       _UINT32_(0xF48)     /* (FUSES_PUF_AC210) Mapped Fuse Register Offset */
#define FUSES_PUF_AC211_REG_OFST       _UINT32_(0xF4C)     /* (FUSES_PUF_AC211) Mapped Fuse Register Offset */
#define FUSES_PUF_AC212_REG_OFST       _UINT32_(0xF50)     /* (FUSES_PUF_AC212) Mapped Fuse Register Offset */
#define FUSES_PUF_AC213_REG_OFST       _UINT32_(0xF54)     /* (FUSES_PUF_AC213) Mapped Fuse Register Offset */
#define FUSES_PUF_AC214_REG_OFST       _UINT32_(0xF58)     /* (FUSES_PUF_AC214) Mapped Fuse Register Offset */
#define FUSES_PUF_AC215_REG_OFST       _UINT32_(0xF5C)     /* (FUSES_PUF_AC215) Mapped Fuse Register Offset */
#define FUSES_PUF_AC216_REG_OFST       _UINT32_(0xF60)     /* (FUSES_PUF_AC216) Mapped Fuse Register Offset */
#define FUSES_PUF_AC217_REG_OFST       _UINT32_(0xF64)     /* (FUSES_PUF_AC217) Mapped Fuse Register Offset */
#define FUSES_PUF_AC218_REG_OFST       _UINT32_(0xF68)     /* (FUSES_PUF_AC218) Mapped Fuse Register Offset */
#define FUSES_PUF_AC219_REG_OFST       _UINT32_(0xF6C)     /* (FUSES_PUF_AC219) Mapped Fuse Register Offset */
#define FUSES_PUF_AC220_REG_OFST       _UINT32_(0xF70)     /* (FUSES_PUF_AC220) Mapped Fuse Register Offset */
#define FUSES_PUF_AC221_REG_OFST       _UINT32_(0xF74)     /* (FUSES_PUF_AC221) Mapped Fuse Register Offset */
#define FUSES_PUF_AC222_REG_OFST       _UINT32_(0xF78)     /* (FUSES_PUF_AC222) Mapped Fuse Register Offset */
#define FUSES_PUF_AC223_REG_OFST       _UINT32_(0xF7C)     /* (FUSES_PUF_AC223) Mapped Fuse Register Offset */
#define FUSES_PUF_AC224_REG_OFST       _UINT32_(0xF80)     /* (FUSES_PUF_AC224) Mapped Fuse Register Offset */
#define FUSES_PUF_AC225_REG_OFST       _UINT32_(0xF84)     /* (FUSES_PUF_AC225) Mapped Fuse Register Offset */
#define FUSES_PUF_AC226_REG_OFST       _UINT32_(0xF88)     /* (FUSES_PUF_AC226) Mapped Fuse Register Offset */
#define FUSES_PUF_AC227_REG_OFST       _UINT32_(0xF8C)     /* (FUSES_PUF_AC227) Mapped Fuse Register Offset */
#define FUSES_PUF_AC228_REG_OFST       _UINT32_(0xF90)     /* (FUSES_PUF_AC228) Mapped Fuse Register Offset */
#define FUSES_PUF_AC229_REG_OFST       _UINT32_(0xF94)     /* (FUSES_PUF_AC229) Mapped Fuse Register Offset */
#define FUSES_PUF_AC230_REG_OFST       _UINT32_(0xF98)     /* (FUSES_PUF_AC230) Mapped Fuse Register Offset */
#define FUSES_PUF_AC231_REG_OFST       _UINT32_(0xF9C)     /* (FUSES_PUF_AC231) Mapped Fuse Register Offset */
#define FUSES_PUF_AC232_REG_OFST       _UINT32_(0xFA0)     /* (FUSES_PUF_AC232) Mapped Fuse Register Offset */
#define FUSES_PUF_AC233_REG_OFST       _UINT32_(0xFA4)     /* (FUSES_PUF_AC233) Mapped Fuse Register Offset */
#define FUSES_PUF_AC234_REG_OFST       _UINT32_(0xFA8)     /* (FUSES_PUF_AC234) Mapped Fuse Register Offset */
#define FUSES_PUF_AC235_REG_OFST       _UINT32_(0xFAC)     /* (FUSES_PUF_AC235) Mapped Fuse Register Offset */
#define FUSES_PUF_AC236_REG_OFST       _UINT32_(0xFB0)     /* (FUSES_PUF_AC236) Mapped Fuse Register Offset */
#define FUSES_PUF_AC237_REG_OFST       _UINT32_(0xFB4)     /* (FUSES_PUF_AC237) Mapped Fuse Register Offset */
#define FUSES_PUF_AC238_REG_OFST       _UINT32_(0xFB8)     /* (FUSES_PUF_AC238) Mapped Fuse Register Offset */
#define FUSES_PUF_AC239_REG_OFST       _UINT32_(0xFBC)     /* (FUSES_PUF_AC239) Mapped Fuse Register Offset */
#define FUSES_PUF_AC240_REG_OFST       _UINT32_(0xFC0)     /* (FUSES_PUF_AC240) Mapped Fuse Register Offset */
#define FUSES_PUF_AC241_REG_OFST       _UINT32_(0xFC4)     /* (FUSES_PUF_AC241) Mapped Fuse Register Offset */
#define FUSES_PUF_AC242_REG_OFST       _UINT32_(0xFC8)     /* (FUSES_PUF_AC242) Mapped Fuse Register Offset */
#define FUSES_PUF_AC243_REG_OFST       _UINT32_(0xFCC)     /* (FUSES_PUF_AC243) Mapped Fuse Register Offset */
#define FUSES_PUF_AC244_REG_OFST       _UINT32_(0xFD0)     /* (FUSES_PUF_AC244) Mapped Fuse Register Offset */
#define FUSES_PUF_AC245_REG_OFST       _UINT32_(0xFD4)     /* (FUSES_PUF_AC245) Mapped Fuse Register Offset */
#define FUSES_PUF_AC246_REG_OFST       _UINT32_(0xFD8)     /* (FUSES_PUF_AC246) Mapped Fuse Register Offset */
#define FUSES_PUF_AC247_REG_OFST       _UINT32_(0xFDC)     /* (FUSES_PUF_AC247) Mapped Fuse Register Offset */
#define FUSES_PUF_AC248_REG_OFST       _UINT32_(0xFE0)     /* (FUSES_PUF_AC248) Mapped Fuse Register Offset */
#define FUSES_DEVSIGN_REG_OFST         _UINT32_(0x0C)      /* (FUSES_DEVSIGN) DEVSIGN Offset */
#define FUSES_BOOT_FLAG_REG_OFST       _UINT32_(0x800)     /* (FUSES_BOOT_FLAG) BOOT CODE FLAGS REGISTER Offset */
#define FUSES_DICE_CDI_INDEX_REG_OFST  _UINT32_(0x810)     /* (FUSES_DICE_CDI_INDEX) Mapped Fuse Register Offset */
#define FUSES_DICE_FW_HASH_INDEX_REG_OFST _UINT32_(0x814)     /* (FUSES_DICE_FW_HASH_INDEX) Mapped Fuse Register Offset */
#define FUSES_BOOT_GPIOSEL_REG_OFST    _UINT32_(0x818)     /* (FUSES_BOOT_GPIOSEL) BOOT EXTERNAL NOTIFICATION IO PIN REGISTER Offset */
#define FUSES_H2PB0_NONSECCLRA_REG_OFST _UINT32_(0x81C)     /* (FUSES_H2PB0_NONSECCLRA) Non-Security Clear Register A Offset */
#define FUSES_H2PB0_NONSECSETA_REG_OFST _UINT32_(0x820)     /* (FUSES_H2PB0_NONSECSETA) Non-Security SET Register A Offset */
#define FUSES_PAC_WRCTRL_H2PB0_REG_OFST _UINT32_(0x830)     /* (FUSES_PAC_WRCTRL_H2PB0) Write Control Register Offset */
#define FUSES_H2PB1_NONSECCLRA_REG_OFST _UINT32_(0x834)     /* (FUSES_H2PB1_NONSECCLRA) Non-Security Clear Register A Offset */
#define FUSES_H2PB1_NONSECSETA_REG_OFST _UINT32_(0x838)     /* (FUSES_H2PB1_NONSECSETA) Non-Security SET Register A Offset */
#define FUSES_PAC_WRCTRL_H2PB1_REG_OFST _UINT32_(0x848)     /* (FUSES_PAC_WRCTRL_H2PB1) Write Control Register Offset */
#define FUSES_H2PB2_NONSECCLRA_REG_OFST _UINT32_(0x84C)     /* (FUSES_H2PB2_NONSECCLRA) Non-Security Clear Register A Offset */
#define FUSES_H2PB2_NONSECSETA_REG_OFST _UINT32_(0x850)     /* (FUSES_H2PB2_NONSECSETA) Non-Security SET Register A Offset */
#define FUSES_PAC_WRCTRL_H2PB2_REG_OFST _UINT32_(0x860)     /* (FUSES_PAC_WRCTRL_H2PB2) Write Control Register Offset */
#define FUSES_IDAU_RCTRL_BFM_REG_OFST  _UINT32_(0x864)     /* (FUSES_IDAU_RCTRL_BFM) Region Control Offset */
#define FUSES_IDAU_RCTRL_PFMANS_REG_OFST _UINT32_(0x868)     /* (FUSES_IDAU_RCTRL_PFMANS) Region Control Offset */
#define FUSES_IDAU_RCTRL_PFMANSC_REG_OFST _UINT32_(0x86C)     /* (FUSES_IDAU_RCTRL_PFMANSC) Region Control Offset */
#define FUSES_IDAU_RCTRL_DRM_REG_OFST  _UINT32_(0x870)     /* (FUSES_IDAU_RCTRL_DRM) Region Control Offset */
#define FUSES_IDAU_CTRL_EN_REG_OFST    _UINT32_(0x874)     /* (FUSES_IDAU_CTRL_EN) Control Offset */
#define FUSES_IDAU_CTRL_WLCK_REG_OFST  _UINT32_(0x878)     /* (FUSES_IDAU_CTRL_WLCK) Control Offset */
#define FUSES_FCW_CWP_REG_OFST         _UINT32_(0x87C)     /* (FUSES_FCW_CWP) CFM Page Write Protect REGISTER Offset */
#define FUSES_FCR_CRP_REG_OFST         _UINT32_(0x880)     /* (FUSES_FCR_CRP) CFM Page Read Protection Register Offset */
#define FUSES_FCR_ECCCTRL_REG_OFST     _UINT32_(0x884)     /* (FUSES_FCR_ECCCTRL) ECC Control REGISTER Offset */
#define FUSES_SUPC_BRCFGUSMOR_BOR_REG_OFST _UINT32_(0x888)     /* (FUSES_SUPC_BRCFGUSMOR_BOR) Boot Rom Configurable SMOR User CFG BOR register Offset */
#define FUSES_SUPC_BRCFGUDSSMOR_REG_OFST _UINT32_(0x890)     /* (FUSES_SUPC_BRCFGUDSSMOR) Boot Rom Configurable DSSMOR User CFG register Offset */
#define FUSES_SUPC_BRCFGUCP0_REG_OFST  _UINT32_(0x894)     /* (FUSES_SUPC_BRCFGUCP0) Boot Rom Configurable CHARGE PUMP User CFG register Offset */
#define FUSES_WDT_SETUP_REG_OFST       _UINT32_(0x898)     /* (FUSES_WDT_SETUP)  Offset */
#define FUSES_F1RR_REG_OFST            _UINT32_(0x00)      /* (FUSES_F1RR) PANEL 0 REDUNDANCY RECORD 1-0 Register Offset */
#define FUSES_FCCFG0_REG_OFST          _UINT32_(0x80)      /* (FUSES_FCCFG0) Calibration Configuration 0 Register Offset */
#define FUSES_FCCFG1_REG_OFST          _UINT32_(0x84)      /* (FUSES_FCCFG1) Calibration Configuration 1 Register Offset */
#define FUSES_FCCFG8_REG_OFST          _UINT32_(0xA0)      /* (FUSES_FCCFG8) Calibration Configuration 8 Register Offset */
#define FUSES_FCCFG16_REG_OFST         _UINT32_(0xC0)      /* (FUSES_FCCFG16) Calibration Configuration 16 Register Offset */
#define FUSES_FCCFG17_REG_OFST         _UINT32_(0xC4)      /* (FUSES_FCCFG17) Calibration Configuration 17 Register Offset */
#define FUSES_FCCFG24_REG_OFST         _UINT32_(0xE0)      /* (FUSES_FCCFG24) Calibration Configuration 24 Register Offset */
#define FUSES_FCCFG27_REG_OFST         _UINT32_(0xEC)      /* (FUSES_FCCFG27) Calibration Configuration 27 Register Offset */
#define FUSES_FCCFG28_REG_OFST         _UINT32_(0xF0)      /* (FUSES_FCCFG28) Calibration Configuration 28 Register Offset */
#define FUSES_FCCFG29_REG_OFST         _UINT32_(0xF4)      /* (FUSES_FCCFG29) Calibration Configuration 29 Register Offset */
#define FUSES_FCCFG32_REG_OFST         _UINT32_(0x100)     /* (FUSES_FCCFG32) DSU Device Configuration 0 Register (DEVID) Offset */
#define FUSES_FCCFG33_REG_OFST         _UINT32_(0x104)     /* (FUSES_FCCFG33) DSU Device Configuration 1 Register Offset */
#define FUSES_FCCFG34_REG_OFST         _UINT32_(0x108)     /* (FUSES_FCCFG34) DSU Device Configuration 2 Register Offset */
#define FUSES_FCCFG49_REG_OFST         _UINT32_(0x144)     /* (FUSES_FCCFG49) Calibration Configuration 49 Register Offset */
#define FUSES_FCCFG56_REG_OFST         _UINT32_(0x160)     /* (FUSES_FCCFG56) Calibration Configuration 56 Register Offset */
#define FUSES_FCCFG57_REG_OFST         _UINT32_(0x164)     /* (FUSES_FCCFG57) Calibration Configuration 57 Register Offset */
#define FUSES_FCCFG58_REG_OFST         _UINT32_(0x168)     /* (FUSES_FCCFG58) Calibration Configuration 58 Register Offset */
#define FUSES_FCCFG59_REG_OFST         _UINT32_(0x16C)     /* (FUSES_FCCFG59) Calibration Configuration 59 Register Offset */
#define FUSES_FCCFG60_REG_OFST         _UINT32_(0x170)     /* (FUSES_FCCFG60) Calibration Configuration 60 Register Offset */
#define FUSES_FCCFG61_REG_OFST         _UINT32_(0x174)     /* (FUSES_FCCFG61) Calibration Configuration 61 Register Offset */
#define FUSES_FCCFG64_REG_OFST         _UINT32_(0x180)     /* (FUSES_FCCFG64) Calibration Configuration 64 Register Offset */
#define FUSES_FCCFG65_REG_OFST         _UINT32_(0x184)     /* (FUSES_FCCFG65) Calibration Configuration 65 Register Offset */
#define FUSES_FCCFG66_REG_OFST         _UINT32_(0x188)     /* (FUSES_FCCFG66) Calibration Configuration 66 Register Offset */
#define FUSES_FCCFG68_REG_OFST         _UINT32_(0x190)     /* (FUSES_FCCFG68) Calibration Configuration 68 Register Offset */

